{"answers":{"TV Film and Stage : Ladies and gentlemen introducing Denzel Washington":"Glory","TV/ Movies: Category: Blazing Saddles: A particularly gross scene involved cowboys eating lots of what":"beans","TV Film and Stage : Who is the female presenter of the TV programme Fort Boyard":"melinda messenger","Category: Scents: Scent filled orb worn as a pendant":"pomander","What is a group of cockroaches":"intrusion","Mythology : what did daedalus construct for minos":"labyrinth","Name that car: ":"porsche","Category: Geography : What is the capital of Angola":"luanda","Word Play : Unscramble ernga":"range","UnScramble this Word:  c r e a d":"cedar","UnScramble this Word:  i h h c w":"which","What is the square root of  144":"twelve","Where is charlottetown":"prince edward island","Word Play : What word links these : gamma gun sting":"ray","TV Film and Stage : Who was the star of the movie Running Brave":"robby benson","UnScramble this Word:  e p i s d r p":"dippers","Category: History : He shot Lee Harvy Oswald.":"ruby","Phobophobia is a fear of ______":"phobias","Baby Names Beginning With \"G\":  Meaning: Servant of God":"gilda","Which American president said, 'The only thing we have to fear is fear itself":"f d roosevelt","Geography: \"Honolulu\" means -------------":"sheltered harbor","What term is applied to ethyl alcohol that has been treated with poison to make it unfit for human consumption":"denatured","Useless Trivia: A lifetime supply of all the vitamins you need weighs only about ---------- ounces.":"eight","What show was Family Matters a spin-off of?":"Perfect Strangers.","\"Earth has not anything to show more fair\" is the first line of a poem by whom":"wordworth","Who sang 'think' in the original 'blues brothers' film":"aretha franklin","TV Film and Stage : Actor born in 1922 in Philadelphia won an oscar for the Odd Couple more famous as Doctor Quincy":"Jack Klugman","Pot Luck : What Norse explorer introduced Christianity to Greenland around 1000 A.D":"leif ericsson","UnScramble this Word:  l i n t e y m s o":"solemnity","Slang word for huge or enormous":"humongous","History : In what year did the last main-line steam train leave Liverpool Lime Street station":"1968","For how many radio stations was john cage's 'imaginary landscaper no 4' scored":"twelve","Category: McDonalds: All of their products seem to be prefaced with which 2 letters":"mc","History : From what did alexander the great and julius caesar and napoleon suffer":"epilepsy","Geography : In which country would you find the Petronas Tower I":"Malaysia","Caribbean plant yeilding a substance used in cosmetics":"aloe vera","Category: Fictional Detectives: TV private eye played by Tom Selleck.":"thomas magnum","UnScramble this Word:  i k i g n s l":"silking","TV/ Movies: Born Mar 14, 1947, He starred in this movie: Running Scared - 1986":"billy crystal","Pot Luck : Who sat on the bench for the Simpson murder trial":"judge ito","What is the popular name for the drug 'drinamyl'":"purple hearts","Second city: Milwaukee (state)":"madison","TV/ Movies: 2000, This Movie was Released on October 20 The ---------- ":"yards","Sport and Leisure : Ncaa : which team lost the mens basketball championship in 1955":"la salle","What type of drink is arabica":"coffee","Category: Emoticons: (^o^)":"happiness","Who invented the word \"assassination\"":"shakespeare","TV/ Movies: Category: Highlander: What is the only way to truly kill an immortal":"beheading","Nature and Biology : A group of ladybird beetles is called a":"swarm","In 1983 Cosmonauts Titov and ---------- are saved from exploding Soyuz T-10. ":"strekalov","UnScramble this Word:  a s e t r n t":"natters","In 1931 Anita---------- , Sweden, actress (La Dolce Vita, War and Peace), born. ":"ekberg","Book or table containing a calendar, together with astronomical and navigational data and, often, religious holidays, historical notes, proverbs, and astrological and agricultural forecasts":"almanac","UnScramble this Word:  a e n g i i m":"imagine","Geography : On what river will you find Kew Gardens":"thames","If you were born on 21 November what star sign (Zodiac) would you be":"scorpio","Pot Luck : What is quicksilver better known as":"mercury","What planet has a magnetic field 50 times stronger than that of Earth":"uranus","In 1945 President ---------- announced atomic bomb secret shared with Britain and Canada. ":"truman","UnScramble this Word:  a k i d n m n":"mankind","What planet does the moon charon orbit":"pluto","Useless Trivia: If you told someone that they were one in a million, you'd be saying there were ---------- of them in China.":"1,800","Who said 'when the going gets tough, the tough get going'":"knute rockne","Whose patron is St Thomas Aquinas":"schools","In 1843 British arrest Irish nationalist Daniel ---------- for conspiracy. ":"o'connell","Pot Luck : Whats used to make grenadine syrup":"pomegranate","In which film is the line, 'I could have been a contender'":"on the waterfront","In 1989 USSR Pres Mikhail S ---------- meets Pope John Paul II at the Vatican. ":"gorbachev","Name The Year: Michael Stipe (REM Lead Singer), born.":"1960","Quotations: \"If you can ----------- it, you can achieve it. If you can dream it, you can become it.\"- William Arthur Wood":"imagine","Nature and Biology : What is a group of coots called":"covert","Which TV cartoon series based in Springfield started life on the Tracey Ullman show":"the simpsons","Lyrics: Guess I should a known by the way you parked your car sideways that it wouldn't last":"Little Red Corvette Prince","TV Film and Stage : Who played Kookie in the T.V. series Seventy Seven Sunset Strip":"ed byrnes","TV/ Movies: 2000, This Movie was Released on September 22 The ---------- ":"fantasticks","Baby Names Beginning With \"K\":  Meaning: A Church":"kirby","Dr. Suess wrote _____________ after his editor dared him to write a book using fewer than fifty different words":"green eggs & ham","Category: Phonetic Radio Call Signs: SPINNER":"sierra papa india november november echo romeo","Animal Trivia: By age 6 months, the voracious ---------- will have increased its 3-pound birth weight by 7,000 percent.":"pig","Acronym Soup: TWTST ":"that will take some thought","Mathematics : What is the square root of 64":"8","Name The Year: Israel destroys alleged Iraqi plutonium production facility.":"1981","Pot Luck : What was first worn on the 10th October 1886":"tuxedo","Useless Facts: Feb 1865 is the only month in recorded history not to have a":"fullmoon","TV/ Movies: 1933 - Lucille Ball - Starred In This Movie: ":"blood money","Name The Year: Mel Gibson, actor, born.":"1956","Where is tobruk":"libya","What is the capital of malta":"valletta","Who earned the nickname \"top gun\" in the Persian Gulf War?":"Colin Powell","TV/ Movies: Born Mar 17, 1951, He starred in this movie: Fool's Parade/Dynamite Man From Glory Jail - 1971":"kurt russell","TV/ Movies: 2000 - George Clooney - Starred In This Movie: ":"the perfect storm","TV Film and Stage : A ___ to India":"Passage","Mathematics : What is 32 decimal expressed in hex":"20","In an average lifetime, the average american visits a ___ 5 times":"psychiatrist","Baby Names Beginning With \"T\":  Meaning: Resurrection":"tasya","Comics and Cartoons : Who drew the Peanuts series of cartoons":"charles schulz","Who developed the laws of electrolysis":"michael faraday","Which class of racing yacht has the same name as a Shakespeare play":"tempest","How many Nightmare On Elm Street movies were made in the 80's?":"5","By what title was Mohandas K Gandhi known":"mahatma","Name The Year: Oliver Cromwell, Puritan lord protector of England (1653-58), born.":"1599","TV/ Movies: Born Nov 11, 1962, She starred in this movie: The Hunchback of Notre Dame - 1996":"demi moore","TV/ Movies: 2000, This Movie was Released on August 25 The ---------- ":"crew","AUTHORS: Who wrote Big Green Book":"robert graves","UnScramble this Word:  l v a n j i e":"javelin","TV Film and Stage : This smurf composes odes to himself and is in essence quite vain":"vanity smurf","Pot Luck : Which countrys ships fly under the Union Jack":"britain","What animal does the adjective 'pardine' refer to":"leopard","TV/ Movies: 1961 - Shirley MacLaine - Starred In This Movie: ":"two loves","Pot Luck : Unit of measure for energy":"joule","Who were Thors two sons (the brave &  the powerful)":"modi &  magni","Pot Luck : December 22nd thru January 19th is what sign":"Capricorn","What is the main food of mosquitoes?":"Nectar","TV Film and Stage : Whose sister Pamela appeared in the 1988 movie Sleepaway Camp 2":"bruce","What is the Capital of: Faroe Islands ":"torshavn","TV Film and Stage : Who entered a contest to find his own look-alike and came 3rd":"Charlie Chaplin","History : In which century was the Ming Dynasty founded in China":"fourteenth","The river Po flows into which sea":"adriatic","Pot Luck : Who was the first New Australian to become in 1961 Miss Australia":"Tania Verstak","Politics : What was the peace treaty between Israel and Egypt signed in 1979 called":"Camp David Accord","Geography : After the breakup of Yugoslavia only one country now beginning with the letter Y what is it":"Yemen","Word Play : Unscramble rokc":"rock","What is the Capital of: Mongolia ":"ulaanbaatar","Art Culture and Literature : Scottish sailor Alexander Selkirk became inspiration for what novel":"Robinson Crusoe","A cantaloupe is a small what":"melon","Science and Technology : What is the name of a small computer introduced in 1975 by Micro Instrumentation Telemetry Systems of New Mexico":"Altair 8800","What was lucy's maiden name on 'i love lucy'":"mcgillicuddy","Name The Year: Robert De Niro, actor (Bang the Drum Slowly, Taxi Driver), born.":"1943","Which is the only liquid metal element at room temperature":"mercury","Name The Year: Paul McCartney, musician (Wings, Beatles)":"1942","Music : Folk singer born in 1941 in Staten Island New York":"Joan Baez","Toxiphobia is a fear of _________":"poisons","Baby Names Beginning With \"L\":  Meaning: Lord":"lave","UnScramble this Word:  y t e s r x s":"xysters","Music : Its A Miracle was performed by":"Culture Club","Geography : In which state is Yale University":"connecticut","TV/ Movies: 1980 - Kurt Russell - Starred in this movie: ":"used cars","In which year did Lenin die":"1924","The Queen of Spades and Jack of Diamonds combine to form the key combination in which card game":"bezique","UnScramble this Word:  e s s i e p n":"penises","What is the capital of sierra leone":"freetown","Pot Luck : What is the german parliament":"bundestag","TV Film and Stage : Which Hollywood smoothie was born Dino Crocetti in 1917":"dean martin","In 1988 ---------- Addams cartoonist (Addams Family), dies at 76 of heart attack. ":"charles","TV Film and Stage : The director of Jaws and Raiders of the Lost Ark":"stephen spielberg","Baby Names Beginning With \"M\":  Meaning: A Bird":"merle","Useless Trivia: According to Genesis 1:20-22, the chicken came before the---------- .":"egg","Name The Year: Norman Parkinson, England, fashion photographer (Harper's Bazaar), born.":"1913","Approximately how many species of butterfly are there":"100 thousand","By what process is rock worn down by the weather":"erosion","What is the toothpick capital of the world":"maine","In 1924 ---------- Clavell, author (Shogun, Tai Pan, King Rat, Noble House, Whirlwind), born. ":"james","Nature and Biology : As what is a wildebeest also known":"gnu","Category: Games : A poker hand consisting of three of a kind and a pair is called a _______.":"full house","History : What color was named after a bloody battle fought in Italy in 1859":"Magenta","TV/ Movies: Category: Academy Awards: Who was the first actor to win an Oscar posthumously":"peter finch","TV Film and Stage : Film Title : ______ : A Space Oddessey":"2001","Name The Year: The Berlin Blockade and Berlin Airlift begin.":"1948","Aussie Slang: Dry as a dead dingo's donger":"drought or very dry climate","Category: Cartoon Trivia : What is the mother's name in Family Circus":"thelma","Which creature was half horse, half man":"centaur","Word Play : Unscramble tocraon":"cartoon","TV/ Movies: Born Nov 21, 1945, She starred in this movie: Bird on a Wire - 1990":"goldie hawn","Music : Little Bitty Pretty One was performed by":"Billy Gilman","Who coined the term 'assassination'":"william shakespeare","Name The Year: Apollo/Soyuz, the first US/USSR linkup in space.":"1969","Of which country is the flame flower a native":"south africa","Edgar allan poe introduced mystery fiction's first fictional detective, auguste c. dupin, in what 1841 story":"the murders in the rue morgue","What us general was known as old blood and guts":"george s patton jr","Word Play : What is a fear of germs":"spermophobia","What is the name of an animal that can pass on bacteria without being affected by the disease itself":"vector","Baby Names Beginning With \"K\":  Meaning: Of the Kelts/Celts":"kelly","What is the holiest day in the Jewish calendar?":"Yom Kippur","TV/ Movies: Born Aug 8, 1937, He starred in this movie: Dick Tracy - 1990":"dustin hoffman","TV/ Movies: Born Sep 9, 1960, He starred in this movie: Extreme Measures - 1996":"hugh grant","UnScramble this Word:  o t h d a e g r":"goatherd","Pot Luck : What was canadas first national park":"banff national park","Word Play : Unscramble ibcan":"cabin","TV/ Movies: Category: Disney Movie: Jaq, Lucifer, Gus Gus":"cinderella","UnScramble this Word:  e s c p r e h":"perches","Geography : Zurich is in which country":"Switzerland","Category: Religion : In what month is Christmas observed":"december","Baby Names Beginning With \"B\":  Meaning: Strong, Virtuous, Honorable":"breanna","Stalingrad who was the only sister on petticoat junction to marry":"betty jo","Pot Luck : What is in apple pips":"cyanide","Music : Who recorded the album wish you were here in 1975":"pink floyd","Comics and Cartoons : What is the name of Dennis the Menaces dog":"Gnasher","80s Films: Somewhere in ___":"Time","Name The Year: First interment in US National Cemetary at Presidio.":"1852","Christian sacrement in which bread and wine are consecrated and consummed":"eucharist","Who was nominated for a Best Actress Oscar for the film Mary, Queen of Scots":"vanessa redgrave","Baby Names Beginning With \"M\":  Meaning: The Tree/Victory":"myrtle","Sydney 2000 Olympics: This countries medal tally was: 0 Gold, 1 Silver, 4 Bronze, 5 in Total":"morocco","History : The first american to walk on the moon in the 70s":"alan shepard","TV/ Movies: Born May 7, 1901, He Starred In This Movie: The Slippery Pearls - 1931":"gary cooper","Music : How did Mark Chapman shock the world":"shot john lennon","Aussie Slang: Chook":"a chicken, rooster or hen","In 1931 ---------- Alva Edison inventor, dies in West Orange, NJ, at 84. ":"thomas","What is the colour of lobster's blood":"blue","DNA stands for what":"deoxyribonucleic acid","Sport and Leisure : What was the setting for walk dont run":"tokyo olympics","Art Culture and Literature : Which novel features Room 101":"1984","Toys and Games : What game tiles were first made with a pocket knife":"scrabble","TV Film and Stage : What was the name of Han Solos spaceship in Star Wars":"millenium falcon","UnScramble this Word:  o r i s e c w":"cowries","Useless Trivia: In Italy, it is illegal to make ---------- out of anything except nutshells or wood.":"coffins","Pot Luck : What was it that killed Attila the Hun during a 30 day honeymoon celebration":"alcohol","Pot Luck : Which bird turns its head upside down to eat":"flamingo","TV/ Movies: 1999, This Movie was Released on September 17 For Love ---------- ":"of the game","Lyrics: You got to roll with the punches to get to what's real":"Jump Van Halen","UnScramble this Word:  i t a p r e a s":"parasite","At 45, what did boxer, George Foreman win":"heavyweight championship","Pot Luck : Where were the ancient script of Linear A and Linear B found":"crete","Word Play : Unscramble ceklbu":"buckle","TV/ Movies: Born April 16, 1889, He Starred In This Movie: Caught in a Cabaret - 1914":"charlie chaplin","What is the capital of the state of Virginia":"richmond","Science and Technology : A typical bed usually houses over how many dust mites":"6 billion","History : What was the instrument of execution during the Reign of Terror":"guillotine","Art Culture and Literature : Who was the author of The Tin Drum":"gunther grass","TV/ Movies: MASH: William O'Reilly earns the name Radar by his ability to hear these transports":"helicopters","Name The Year: William Butler Yeats Irish poet, dies in France at 73.":"1939","Whom did David Steel succeed as leader of the Liberal Party":"jeremy thorpe","Name The Year: Wembley Stadium opens-Bolton Wanderers vs West Ham United (FA Cup).":"1923","Nature and Biology : The horned lizard of the American southwest may squirt a thin stream of _______ from the corners of its eyes when frightened":"blood","80s Films: ___ By Me":"Stand","TV/ Movies: Category: Muppet Mania: He was the muppeteer controlling Gonzo and Dr. Bunsen Honeydew":"dave goelz","The symbol on the \"pound\" key () is called a(n) _________":"octothorpe","Geography : San Francisco is in which country":"USA","TV/ Movies: 1984 - Arnold Schwarzenegger - Starred In This Movie: ":"conan the destroyer","Food and Drink : From what country do we get Avia wines":"yugoslavia","Where were George Mallory & Andrew irvine heading when they were last seen alive":"summit of everest","Pot Luck : Where did guinevere retire to die":"amesbury","Who is the patron saint of sheep raisers":"st raphael","What is a group of this animal called: Antelope":"herd","What is the only dog to have a barb on each individual hair follicle":"dalmatian","Food and Drink : In what kind of buildings are hops dried":"oast house","In 1952 First ---------- high frequency (UHF) television station, Portland, OR. ":"ultra","TV/ Movies: TV Actresses: Krystle on Dynasty":"linda evans","What is a langouste":"crawfish","Name The Year: Tripoli declares war on US for refusing tribute. ":"1801","Which are the twin cities":"minneapolis and saint paul","Who was born marion morrison":"john wayne","Art Culture and Literature : Who painted A Bar at the Folies Bergere (1882)":"edouard manet","Who was the American master of decorative \"art nouveau\" glass, especially lamps":"louis comfort tiffany","TV Film and Stage : Lost ___":"Boys","What was the first grand slam tennis title won by steffi graf":"french open","What metal do fools mistake iron pyrites for":"gold","Which Olympics did the US boycott?":"980","Mythology : who did ariadne help to escape the labyrinth":"theseus","Category: Fast Food: At North American pizza outlets, this is often referred to as \"Canadian bacon\"":"ham","Comics and Cartoons : What is Dennis the Menaces last name":"mitchell","Sport and Leisure : In what sport is the term terminal speed":"drag racing","TV/ Movies: Born Nov 11, 1962, She starred in this movie: Now and Then - 1995":"demi moore","What country has the biggest population":"china","Useless Trivia: Boanthropy is a disease in which a man thinks he is an---------- .":"ox","TV/ Movies: Born Mar 17, 1951, He starred in this movie: The Absent-Minded Professor - 1961 ":"kurt russell","Geography : Into which bay does the ganges river flow":"bay of bengal","Art Culture and Literature : Australian feminist-author of the Female Eunich was born in 1939":"Germaine Greer","A Backgammon board is marked out in sawtooth \"points\" in two colours. How many of these points are there":"twenty four","Geography : Devon is the only county in Great Britain to have two ______":"coasts","In the English legal system there are three Divisions in the High Court of Justice. One is the Family division. Name the other two":"queen's bench & chancery","Hundred when does the uterus expand 500 times its normal size":"during pregnancy","Useless Facts: Left-handed people are ----- percent more likely to sample a forkful of food from the plates of fellow diners than are right-handed people.":"twenty","Baby Names Beginning With \"M\":  Meaning: Solitary Life":"monisha","Nosophobia is the fear of":"disease","Name The Year: Liverpool's Cavern Club, the home of the Beatles, reopens.":"1984","Word Play : Emetophobia is a fear of what":"vomiting","Who was the author of 'dracula'":"bram stoker","Geography : In which country would you find the Angel Falls":"venezuela","Category: Sport : In which sport is the Cy Young Trophy awarded":"baseball","Music : Handels Harmonious Blacksmith was written for what instrument":"Harpsichord","Pot Luck : What is the phonetic alphabet word for the letter P":"Papa","Music : Who was the drummer with the Police":"Stewart Copeland","Which is the nearest galaxy to our own, excluding the Magellanic Clouds":"andromeda","TV Film and Stage : The main street in Back to the Future is also the main street in what other 80s movie":"Gremlins","Nature and Biology : A shrimp has _______ pairs of legs":"five","TV/ Movies: Category: Defining Roles: M.A.S.H. [the movie]--> Benjamin Franklin \"Hawkeye\" Pierce":"donald sutherland","What was 1990s most populous U S state":"california","Which US cop series had the catchphrase \"who loves ya baby'":"kojak","Who is the patron saint of monks":"st benedict","Category: Trivia : What golfer is nicknamed \"The Great White Shark\"":"greg norman","The screw was invented after the _______":"screwdriver","Toys and Games : In order for a deck of cards to be mixed up enough to play with properly at least how many times should it be shuffled":"seven","Word Play : Unscramble riuhcz":"zurich","TV/ Movies: Born Aug 6, 1911, She starred in this movie: The Affairs of Cellini - 1934":"lucille ball","What civil war was fought between 1936 and 1939":"spanish civil war","In 1364 Battle of Auray, English forces defeat ---------- at Brittany. ":"french","Name The Year: Russia cedes Livonia & Estonia to Poland, loses access to the Baltic.":"1582","Politics : Who succeeded Pompidou as French president":"valery giscard destaing","If you were born on 04 March what star sign (Zodiac) would you be":"pisces","In 1957 Siobhan ---------- rocker (Bananarama), born. ":"fahey","What is the name of the sign which is put over the letter 'n' in Spanish, to give a 'nya' sound":"tilde","From where do alsatians originate":"alsace-lorraine","TV Film and Stage : In Plaza hotel who played the castaway cowboy":"james garner","Name The Year: Digital Equipment Corp introduces the PDP-11 minicomputer.":"1970","Category: Oddities: This pop-star owns most of the Beatles copyrights":"michael jackson","Name The Year: Gracie Allen, Mrs George Burns/comedian (Burns and Allen), born.":"1902","A condition causing breathing difficulties":"asthma","TV/ Movies: 1932 - Lucille Ball - Starred In This Movie: ":"the kid from spain","In 1924, pope urban viii threatened to excommunicate people who used what":"snuff","Useless Trivia: It can take as long as ---------- hours to hard-boil an ostrich egg.":"four","Pot Luck : Which trophy is inscribed The Gentlemens Single-Handed Championships of the World":"wimbledon mens singles cup","Word Play : What is the fear of worms known as":"scoleciphobia","If you were born on 29 August what star sign (Zodiac) would you be":"virgo","TV/ Movies: Born Nov 19, 1962, She starred in this movie: Stealing Home - 1988":"jodie foster","Channels In 1978, whose music did Def Leppard like to cover in small clubs":"thin lizzy","Pot Luck : What is the name of the lift used to raise boats from river to a canal system called":"anderton lift","Music : I want to come over was performed by":"Melissa etheridge","When Spencer Tracy won his first Academy award in 1937, his Oscar statuette mistakenly bore the name of which detective":"dick tracy","Lyrics: My fantasy has turned to madness and all my goodness has turned to badness":"Obsession Animotion","What is the speech at the beginning of a play called":"prologue","Geography : Into what ocean does the Zambezi river flow":"indian","Science and Technology : What is the atomic number of tungsten":"74","Name The Year: US Marines landed in Nicaragua to protect US citizens.":"1896","Quotations: \"If you cannot get your ---------- to call you, try not paying his bill.\"- Pete Ferguson":"lawyer","Mythology : Name the Greek equivalent of the Roman god Saturn":"cronos","TV/ Movies: Category: Quantum Leap 2: Al's last name (watch the spelling!)":"calavicci","Mathematics : The geometric shape found on the Bass Pale Ale bottle":"triangle","Nature and Biology : Name the smallest breed of dog":"chihuahua","Nature and Biology : What is the process by which certain animals are able to reproduce themselves in successive female generations without intervention of a male of the species":"parthenogenesis","Art Culture and Literature : In what year was Darwins Origin of the Species published":"1859","UnScramble this Word:  a u o e c g r":"courage","UnScramble this Word:  e h n c f r":"french","Pot Luck : Which capital city is built on the site of ancient Tenochtitlan":"mexico city","What is the most dangerous job in the u.s":"commercial fishing","Which compound comes from the nux vomica tree":"strychnine","Which is the most ancient walled city":"jericho","What central American country extends furthest north":"belize","Nature and Biology : What is the longest recorded flight of a chicken":"13 seconds","In 1982 Israeli forces began pouring into west---------- . ":"beirut","Pot Luck : What sort of ship has a runway on its deck":"aircraft carrier","TV/ Movies: Category: Defining Roles: Funny Girl--> Fanny Brice":"barbra streisand","TV/ Movies: 1974 47th Academy Awards: Best Actress In A Leading Role Was Won By Ellen Burstyn For The Movie:":"alice doesn't live Here Anymore","Acronym Soup: MOTSS ":"member of the same sex","In 1962 N. Korea reports ---------- election turnout, 100% vote for Workers' Party. ":"100%","Of whom was it said by Gerald Ford, 'He doesn't dye his hair - he's just prematurely orange'":"ronald reagan","What did eric morley found":"miss world competition","Pot Luck : Whats the adhesion of molecules to the surfaces of solids called":"absorbtion","Science and Technology : He is known for his theory of Evolution":"charles darwin","History : Who was the last reigning King of Egypt":"farouk","Which mythological creature was half man, half horse":"centaur","Telephonophobia is a fear of ______":"telephones","A stitch in time saves ____":"nine","Geography : What is the capital of Kiribati":"Tarawa","TV/ Movies: Born Aug 6, 1911, She starred in this movie: The Affairs of Annabel - 1938":"lucille ball","History : Which English King met Francis I of France on the Field of the Cloth of Gold":"Henry VIII","UnScramble this Word:  e o e r u p":"europe","who was the 16th president of the united states?":"abraham lincoln","TV/ Movies: Category: Independent Films: 1992 Clinton campaign documentary which popularized \"It's the Economy, Stupid\"":"the war Room","Pot Luck : What did Pandora release when she opened her box":"troubles and misery","What is the main ingredient in glass?":"Sand","What is the flower that stands for: argument":"fig","Music : Who helped George Harrison produce My Sweet Lord":"phil spector","Category: Hollywood : Actor: ________ Hackman.":"gene","TV/ Movies: Category: Hollywood: First member of the original Saturday Night Live to leave the show.":"chevy chase","TV/ Movies: Category: Flicks: Jack Nicholson movie about mental hospital and R.P. McMurphy.":"one flew over the cuckoos nest","Baby Names Beginning With \"Y\":  Meaning: Little Dove":"yoninah","Who was king of macedonia from 336 to 323 b.c":"alexander the great","Because metal was scarce during world war ii, of what were the oscars made":"wood","The average adult human has 32 of these?":"Teeth","UnScramble this Word:  g h a m r a":"graham","In 1452 First book published, Johann Guttenberg's---------- . ":"bible","Word Play : Unscramble ssimue":"misuse","TV/ Movies: Born Nov 19, 1962, She starred in this movie: Alice Doesn't Live Here Anymore - 1974":"jodie foster","What word is given to the distance within which a sound can be heard":"earshot","Sailors lacking vitamin c would contract which disease":"scurvy","Food and Drink : What is the white of an egg":"albumen","Useless Trivia: Ethernet is a registered trademark of---------- , ":"xerox","Name The Year: B.C. Cicero, Roman statesman, born.":"106","Name The Year: Carl Ritter, cofounder of modern science of geography, born.":"1779","UnScramble this Word:  g y l a a n o":"analogy","In what year did Freddie Mercury die":"1991","TV/ Movies: 1999, This Movie was Released on November 12 Light ---------- ":"it up","Category: Barbie Dolls: Where Barbie goes skiing":"sun valley","Pot Luck : Where is Huracan stadium":"buenos aires","Name both of the planets that can be seen, from the Earth, 'in transit' - i.e. passing in front of the sun":"mercury & venus","Music : Wrap It Up was performed by":"Fabulous Thunderbirds","Rock Groups: Tom Petty and the _____":"heartbreakers","Pot Luck : What is the name of the layer between the Earths crust and the Earths core":"mantle","what future yippie leader was the first male cheerleader at brandeis?":"abbie hoffman","Acronym Soup: GTG ":"got to go","UnScramble this Word:  n r i a p h a":"piranha","Sport and Leisure : Test great Neil Harvey criticised Steve Waughs baggy green what":"Cap","What is the currancy unit of El Salvador":"colon","Nature and Biology : What do butchers call the edible internal part of an animal":"offal","80s Films: ___show":"Creep","UnScramble this Word:  r n d a e b o":"broaden","Pot Luck : With what are camel hair brushes made":"squirrel hairs","TV/ Movies: Who won the Oscar for best ACTRESS in a Leading Role in 1986 59th Academy Awards for the Movie CHILDREN OF A LESSER GOD":"marlee matlin","Of the Somme With what acid do nettles cause irritation":"Formic acid","Who composed The Carnival of the Animals":"saint saens","Which classic French dish contains chicken, bacon and red wine":"coq au vin","Word Play : Unscramble atverne":"veteran","Food and Drink : What is the name of the Kelloggs cereal prefixed with the word healthwise":"bran flakes","UnScramble this Word:  t e b a l":"table","In 1821 Costa Rica, El Salvador, Guatemala, Honduras and ---------- gain independence. ":"nicaragua","TV/ Movies: Born Oct 4, 1946, She starred in this movie: Pretty Baby - 1978":"susan sarandon","80s Films: A ___ with a View":"Room","UnScramble this Word:  s e e v r":"serve","Pot Luck : In 1994 what could you rent for as little a usd 50-day in Johannesburg":"AK-47 assault rifle","Animal Trivia: When a ---------- is first born, it is male, and it gradually evolves to female as it matures.":"shrimp","TV/ Movies: Who was Goldfinger's bodyguard":"oddjob","What plant's bulb can make you cry":"onion","What object is said to bring bad luck if it is broken":"mirror","Who is the hero of Rider Haggard's adventure, King Solomon's Mines":"alan quartermain","If you were born on 09 February what star sign (Zodiac) would you be":"aquarius","What is the Capital of: Congo, Dem. Rep. of the ":"kinshasa","Of what did robert the bruce, king of scotland, die in 1329":"leprosy","Who is the norse god of thunder and war":"thor","Music : Hip To Be Square was performed by":"Huey Lewis And The News","Quotations : Life is an incurable _______.- Abraham Cowley":"disease","In 1899 Duke  ---------- bandleader (Take the A Train), born. ":"ellington","Pot Luck : Whose last words were lets do it":"Garry Gilmore","Acronym Soup: IB":"i'm back","Pot Luck : What shouts tip me over pour me out in a childrens song":"little teapot","Useless Trivia: Ice cream was originally made without sugar and---------- .":"eggs","Pot Luck : How tall was the worlds shortest man":"twenty six inches","Pot Luck : What was David Shepherds position before he became Bishop of Liverpool":"bishop of woolwich","The countries of Sarawak and Brunei lie on which island":"borneo","Geography: Nature's totem, the awe-inspiring, 325-foot spire of Chimney Rock in -----------, informed Pony Express riders and frontiersmen they had crossed the American plains and that mountains lay ahead.":"nebraska","Music : Nikita was performed by":"Elton John","What's the international radio code word for the letter \"L\"":"lima","Useless Trivia: A ---------- occurs when all the planets of the our Solar System line up.":"sysygy","Useless Trivia: Diet Coke was only invented in---------- .":"1983","TV/ Movies: Who was originally cast as the scarecrow in \"The Wizard Of Oz\" (1939)":"buddy ebsen","TV Film and Stage : How many films did Charles Chaplin make during his 53-year carer from 1914 to 1967":"89","Geography : Budapest is the capital of ______":"hungary","To who did the sword excalibur belong":"king arthur","Short legged long bodied dog":"dachshund","Category: Beer: The brewery in derge's hometown, Frederick, Maryland, brews under this label.":"blue ridge brewery","Politics : Who was the Russian Foreign Minister from 1957 to 1985":"gromyko","As what was Istanbul previously known":"Constantinople","Category: Geography : Which European country has the lowest population density":"iceland","Who fought professionally in roman arenas":"gladiator","TV/ Movies: Category: Independent Films: Mark Wahlberg allegedly wore a prosthetic device in this 1997 film":"boogie nights","Category: Quick! Quick! : The season ______ comes right after Spring.":"summer","Useless Trivia: A castrated male reindeer is called a---------- .":"bull","Name The Year: 1st all-talking motion picture shown, in NY.":"1928","Pot Luck : Uranus moons are all named after":"shakespearean women","UnScramble this Word:  c d d s a e u":"adduces","Pot Luck : Whats nm to a sailor":"nautical mile","Word Play : Unscramble hesudr":"rushed","Pot Luck : Bill and Hilary Clinton switched on the christmas tree lights in belfast in which year":"1995","What creature acts as a carrier of the diseae bilharzia":"freshwater snail","Who was the last King of France":"louis philippe","Name The Year: Peabo Bryson, singer, born.":"1951","Science and Technology : Which bomb used in the Dambuster raids was invented by Barnes Wallis":"bouncing bomb","UnScramble this Word:  p s u i o i m":"impious","What is the flower that stands for: bravery":"oak leaves","TV/ Movies: Category: Indiana Jones: What nationality was rival archaeologist Rene Belloq?":"french","TV Film and Stage : Sheena Easton sang the title song for which James Bond film":"for your eyes only","Name The Year: First computer chess tournament.":"1970","Pot Luck : There are 15 peaks in Europe higher than Mont Blanc. In which mountain range are they":"caucasus","Name The Year: Constantius II, Roman emperor (337-61), born.":"317","Which animal sleeps with one eye open":"dolphin","Pot Luck : Which is sculptor Gutzon Borghuns most famous work":"mount rushmore","As pretty as a ______":"picture","Category: Monopoly: Cost to buy Vermont Avenue":"100","What sport was involved in the movie \"kansas city bomber\"":"roller derby","Category: Trivia : Who said 'Everything must either be or not be, whether in the present or in the future'":"aristotle","In 1865 (USA) Coffee ---------- invented. ":"percolator","The State Duma is the lower house of assembly in the parliament of which country":"russia","Category: General : Shepherd's pie is meat hash covered with a layer of this (2 wds)":"mashed potatoes","Useless Facts: There are 6,272,640 square inches in an --------":"acre","How many dimples does a golf ball have":"three hundred and thirty six","Sport and Leisure : In which game are there hashmarks on each five-yard line":"football","If you were born on 04 June what star sign (Zodiac) would you be":"gemini","What rock makes the cheapest, softest form of sandpaper":"flint","Name The Year: Guglielmo Marconi patents the radio.":"1898","Category: Contemporary Authors: Won the Pulitzer Prize for The Cancer Ward":"alexander solzhenitsyn","In what did someone squish her hands to make the sound of e.t walking":"jelly","TV/ Movies: Game show: who has hosted more game shows than anybody":"bill cullen","Mythology : Who led the retaliatory army from Argos against Thebes":"Adrostus","Word Play : What word links these : barrier bite track":"sound","TV/ Movies: 1936 - Lucille Ball - Starred In This Movie: ":"bunker bean","Paraskavedekatriaphobia is a fear of ______":"friday thirteenth","Art Culture and Literature : Who sold a cow for five beans":"Jack","Useless Trivia: ---------- are called brussel sprouts because they were discovered in Brussels.":"brussel sprouts","Sport and Leisure : What is the name of the company that was the first shirt sponsor of Liverpool football club":"hitachi","In Magnum PI,what was the name of the charter service that TC ran?":"Island Hoppers","By what name is the bird Pica Pica better known":"magpie","Pot Luck : What is a slang name for diamonds":"ice","Defeated in a footrace in greek mythology what did atlanta want to do until she was defeated in a footrace":"remain unmarried","Name The Year: Finland surrendered to the Soviet Union during World War II.":"1940","TV/ Movies: 1925 - Gary Cooper - Starred In This Movie: ":"wild horse mesa","UnScramble this Word:  a r e t h w e":"weather","Diana ross sings 'everytime you touch me i become a hero'. what is the song title":"when you tell me that you love me","UnScramble this Word:  c s n s i t e":"insects","What Liverpool band popularized the Doors' \"People Are Strange?\" in the 80's?":"Echo and the Bunnymen","Name The Year: Phil Collins, musician (Genesis), actor (Buster), born.":"1941","Baby Names Beginning With \"L\":  Meaning: The Mountain":"lamont","TV/ Movies: 1991 - Lauren Bacall - Starred In This Movie: ":"all i want for christmas","Pot Luck : The love apple is more commonly known as what":"tomato","Animal Trivia: The electric eel's shocking power is so great that it can overtake its victims while ----------":"15 feet away","From what platform does the 'chattanooga choo choo leave pennsylvania station":"twenty nine","Geography : In which country were castanets invented":"Egypt","Pot Luck : Tom hallick was the first male host of which show":"entertainment tonight","Pot Luck : The longest tunnel connects new york and ______":"delaware","who was the only sister on petticoat junction to marry?":"betty jo","Geography : Buffalo River National Park is in which state":"arkansas","Baby Names Beginning With \"N\":  Meaning: Pea Plant":"nili","What country saw the origin of lawn tennis":"england","There are 318,979,564,000 possible ways of playing just the first four moves on each side in a game of":"chess","What late night show replaced Tom Synder's show?":"David Letterman","Pot Luck : Under what name did norma jean mortenson become famous":"marilyn monroe","Selaphobia is the fear of":"light flashes","What is 9 metres high, 7 metres wide and 2,500 kilometres long":"great wall of","How many cells die in the human body every minute":"300,000,000","UnScramble this Word:  o s e k t r c":"rockets","What is the standard unit of measure for weighing gems":"carat","Useless Trivia: Fur ---------- get miserably sick when they're carried aboard ships.":"seals","In 1952 Dumitru---------- , first Rumanian space traveler (on board Soyuz 40), born. ":"prunariu","Geography : On Whos the Boss what was Samanthas liscense plate on her first car":"SAMS CAR","Japan's equivalant to the dollar is ______":"yen","What is ix":"9","TV/ Movies: Born Aug 17, 1943, He starred in this movie: Born To Win - 1971":"robert de niro","Who was the author of the series of novels referred to as the Raj Quartet":"paul scott","Art Culture and Literature : Who wrote Every Living Thing":"james herriot","History : Who was Hitlers propaganda minister":"goebbels","Category: People: They had an album and a song entitled 'All the Young Dudes'":"mott the hoople","Category: Trivia : U.S. President, Woodrow __________.":"wilson","Category: General : Founded in 1608 by Champlain, it was the capital of New France":"quebec","Category: Author : \"Catch 22\"":"joseph heller","Word Play : What is the common name for a word like NASA formed from the initials of other words":"Acronym","Geography : In which country would you find the Alvaro Obregon dam":"Mexico","Music : In the field of entertainment by what name is Emma Bunton better known":"baby spice","TV Film and Stage : When going on stage actors consider it bad luck to be wished what":"good luck","Pot Luck : What was tokyo originally known as":"edo","TV Film and Stage : For which series of films did Talbot Rothwell write most of the scripts":"the carry on films","Baby Names Beginning With \"H\":  Meaning: Wasteland":"heath","\"janie's got a gun\" was on their 1989 album \"pump\"?":"aerosmith","What is meat slaughtered according to Muslim law":"halal","How many men have walked on the moon":"twelve","TV Film and Stage : Who directed The French Connection and The Exorcist":"william friedkin","TV/ Movies: 1986 - Demi Moore - Starred In This Movie: ":"wisdom","What is the misshapen ear that boxers often have":"cauliflower ear","Category: Religion : Who is the Linux operating system named after ":"linus torvalds","History : Mary Queen of Scots was imprisoned in which castle prison in 1567":"Lochleven","Word Play : Malaxophobia is a fear of what":"love play","What is \"the other white meat\"":"pork","Music : Domino was performed by":"Kiss","Music : Nasty was performed by":"Janet Jackson","What did Gene Autry name his ranch":"melody ranch","What german philosopher claimed morality required a belief in god and freedom":"immanuel kant","Geography : In what Australian state would you find Salisbury":"south australia","Toys and Games : Name the only flexible murder weapon in the game of Cluedo":"rope","UnScramble this Word:  i n e t e f f":"fifteen","Kate barton became the first bus conductress in 1909, 1920 or 1933":"1909","Name The Year: Roman Polanski director (Knife in the Water, Repulsion, Macbeth), born.":"1933","Comics and Cartoons : In what city does Fat Albert live":"philadelphia","What kind of machines are floppy discs used in":"computers","TV Film and Stage : Who starred as History lecturer Jim Dixon in the film version of Kingsley Amis novel Lucky Jim":"ian carmichael","In which US state is the Pentagon":"virginia","Acronym Soup: JMOOC ":"just my opinion of course","Which vertebrate holds the record for the longest recorded life span":"tortoise","Hitchhiker's Guide: What race writes the third worst poetry in the Universe":"Vogons","Which musician wrote the book \"twixt twelve and twenty\" in 1958":"pat boone","Quotations : Who said all you need to fly are lovely things and fairy dust":"peter pan","UnScramble this Word:  n y k e d o":"donkey","TV/ Movies: 1950 - Elizabeth Taylor - Starred In This Movie: ":"father of the bride","Music : Who sang popsicle hangin tough please dont go girl and step by step":"new kids on the block","What is the world's deepest lake?":"Lake Baikal","Pot Luck : Which is the only work by Dukas most people have ever heard of":"the sorcerers apprentice","Music : What father-daughter duo made Gag Me With a Spoon a household phrase during the eighties":"Frank and Moon Unit Zappa","TV Film and Stage : Who portrayed Moses in The Ten Commandments":"charlton heston","Who invented scissors":"Leonardo Da Vinci","The treatment of disease by chemical substances which are toxic to the causative micro organisms is called ________":"chemotherapy","Category: Medicine : Encephalitis affects the ________.":"brain","On which mountain did noah's ark run aground":"mount ararat","Mathematics : The solid figure generated when a circle rotates about a diameter every point on its surface being thus equidistant from the center of this circle":"sphere","Music : I Keep Forgettin (Every Time Youre Near) was performed by":"Michael McDonald","Nature and Biology : The great horned owl can turn its head _______":"270 degrees","Art Culture and Literature : Complete the couples - Jean Paul Sartre and ______ __ _______":"simone de beauvoir","TV/ Movies: 1939 - Judy Garland - Starred In This Movie: ":"the wizard of oz","What Scottish city does a Glaswegian call home":"glasgow","Name The Year: The Soviet Union invaded Austria during World War II.":"1945","Mythology : Who allowed herself to be diverted by three golden apples":"Arion","What is the russian equivalent of the name john":"ivan","Food and Drink : What snack food was portrayed in claymation dancing to Heard it Through the Grapevine":"Raisins","Treatment of disease by various approaches":"therapy","What was the first rap group to appear on 'american bandstand'":"run d.m.c","Music : Main Theme was performed by":"Braveheart","Pot Luck : Who was made the first Holy Roman Emperor":"charlemagne","What made up the Bouquet in the 70's TV series starring Susan Penhaligon":"barbed wire","Art Culture and Literature : Who wrote We the Living":"ayn rand","Category: Trivia : How many feet are in a nautical mile ":"6080","Word Play : Leprophobia is a fear of what":"leprosy","What are train drivers called in the U.S.A.":"engineers","Music : What was the original name of paul mccartneys fictional church cleaner eleanor rigby":"miss daisy hawkins","Art Culture and Literature : Author of The Man in the High Castle":"phillip k. dick","Useless Trivia: According to one study, ---------- of lawns have some sort of lawn ornament.":"24%","In which film does Elvis Presley play an American soldier based in Germany":"gi blues","Maracaibo is the second largest city in which South American country":"venezuela","As what is the tree with the botanical name 'Betula' better known":"birch","UnScramble this Word:  l r i s n f o":"florins","Word Play : What is the fear of wines known as":"oenophobia","Word Play : What is the fear of symbolism known as":"symbolophobia","Which size of paper measures 210 x 297mm":"a4","Music : Find Your Way Back was performed by":"Starship","Geography : Darwin is in which country":"Australia","Geography : what country is identified by the letters hk":"hong kong","What is the world's most popular spice":"pepper","What is the flower that stands for: slighted love":"yellow chrysanthemum","Geography : In which country would you find the KTHI TV Mast":"USA","Category: Scents: Opium pusher":"yves st. laurant","Acronym Soup: WPKOL ":"wet passionate kiss on the lips","AUTHORS: Who wrote Wild Sargasso Sea":"jean rhys","Music : In 1965 they urged you to keep on dancing":"the gentrys","Politics : In what year did Joseph Stalin die":"1953","Word Play : Unscramble cjyeko":"jockey","Science and Technology : He invented bifocal lenses for eyeglasses":"benjamin franklin","Art Culture and Literature : Stephen King - Where the good guys settle in The Stand (city state)":"boulder colorado","Pot Luck : What is Pogonophobia the fear of":"Beards","Baby Names Beginning With \"A\":  Meaning: Last Daughter":"audi","Geography : Whats the capital of Vermont":"montpelier","Category: Phonetic Radio Call Signs: CHINGADA":"charlie hotel india november golf alpha delta alpha","TV Film and Stage : Which 1964 release was the most successful Disney film at that time":"mary poppins","Who is the Patron Saint of painters":"saint luke","AUTHORS: Who wrote Das Capital":"karl marx","History : The powerful English longbows were the primary reason that the English defeated which nation at the Battle of Crecy in 1346":"France","Geography : The city of Tours stands on which river":"loire","Acronym Soup: ROFLWPIMP ":"rolling on floor laughing whilst peeing in my pants","Who wrote the books on which the television series The Darling lands of May was based":"h e bates","Sport and Leisure : What race in the sport called coursing":"greyhound","Baby Names Beginning With \"N\":  Meaning: White Haired":"nuala","In 1758 Noah---------- , lexicographer ":"webster","UnScramble this Word:  n s u e o i g":"igneous","What does 'HTTP' stand for":"Hypertext Transfer Protocol","When did the British Empire become the commonwealth":"1931","80s Films: The Man With Two ___":"Brains","UnScramble this Word:  v d e l b i e":"bedevil","Who was Spandau Prison's last inmate":"rudolf hess","TV/ Movies: Born Oct 8, 1949, She starred in this movie: One Woman or Two - 1987":"sigourney weaver","Word Play : Unscramble lhwri":"whirl","Pot Luck : Which group did lou reed front who in the 60s recorded heroin and sweet jane":"velvet underground","To within 3 mph, at what speed in m.p.h. does a wind become a hurricane":"seventy three","Which New Zealand novelist won the Booker Prize with her novel The Bone People":"keri hulme","Acronym Soup: YSS ":"you suck severely","Baby Names Beginning With \"R\":  Meaning: Wise":"raegan","TV/ Movies: Category: Dr Seuss: The number of hats Barholomew Cubbins wore":"500","Science and Technology : A stream may disappear down a sink-hole by what other name is this known":"swallow hole","Science and Technology : When was gas lighting invented":"1792","Pot Luck : What was the name of Matt Dillons band in Singles":"Citizen Dick","Nature and Biology : A male _______ becomes fully feathered when he is three years old but can mate earlier":"peacock","In what year did Quen Elizabeth ll go through the channel tunnel":"1994","TV Film and Stage : What sort of establishment is the setting for the movie The China Syndrome":"nuclear power plant","What is a group of cats":"clowder","Religion : Where in India is the Golden Temple centre of the Sikh religion":"amritsar","Name The Year: Mexico's deposed emperor Maximilian is executed.":"1867","Sport and Leisure : Which F1 racing driver after receiving the last rites went on to win 2 world championships":"niki lauda","Which major US city is in Dade County":"miami","What outdoor sport does 'love' mean a score of zero in":"tennis","Category: Americanisms : Britains say 'tarmac'; Americans say ________.":"runway","History : First known ascent in a hot-air balloon by Father Bartolomeu de Gusmao took place in which country in 1709":"Portugal","TV/ Movies: Category: Entertainment Potpourri: Italian movie star that made Life's cover six times":"sophia loren","Baby Names Beginning With \"L\":  Meaning: To Talk":"loba","Creedence clearwater revival sings 'have you ever ______'":"seen the rain","What is the legal term for a formal agreement enforceable by law":"contract","US Captials - New Jersey":"Trenton","UnScramble this Word:  r b l m u e":"lumber","TV/ Movies: Born Sep 5, 1940, She starred in this movie: Bandolero! - 1968":"raquel welch","Name The Year: \"La Marseillaise\", the French national anthem, is composed by Claude-Joseph Rouget de Lisle.":"1792","Art Culture and Literature : Who was Poet Laureate from 1843 to 1850 during which period he wrote no poetry at all":"william wordsworth","What is a group of frogs":"army","Name The Year: USSR launches 1st intercontinental multistage ballistic missile.":"1957","Pot Luck : Who called overcrowded poorly ventilated hospitals gateways to death":"florence nightingale","Pot Luck : A little over one hundred years ago what arrived in the United States for the first time. It was transmitted by an infection carried aboard the Hamburg-American Lines Moravia on August 30 1892":"cholera","Useless Facts: One out of every three British males between the ages of 17 and 35 was killed in -------------.":"world war i","In 1881 William Edward Boeing, founded ---------- company ":"aircraft","TV/ Movies: 1989 - Drew Barrymore - Starred In This Movie: ":"see you in the morning","TV/ Movies: Born Aug 25, 1930, He starred in this movie: Sword of the Valiant - 1984":"sean connery","Category: Sport : Who was the first NHL player to score 50 goals in one season":"maurice  richard","Who produced and directed the film 'Citizen Kane'":"orson welles","Name The Year: Groucho, Chico and Harpo's final TV appearance together.":"1959","TV Film and Stage : What was the first name of the best friend of Rhonda in the hit TV show":"Ida","Science and Technology : What organ endured its first us transplant in 1954":"kidney","Baby Names Beginning With \"T\":  Meaning: Loved One/Lovable":"thandeka","Doubly-ionised helium atoms, when emitted by some radioactive nuclei, are known as what":"alpha particles","In the anglo-saxon poem, who killed grendel":"beowolf","What is the flower that stands for: relieve my anxiety":"christmas rose","Music : Kiss me deadly was performed by":"Lita Ford","What is the cardinal number for a set of 10 elephants":"ten","UnScramble this Word:  e c i s l n h":"lichens","Name The Year: Portuguese defeat Castilians at Aljubarrota, retain independence.":"1385","Comics and Cartoons : Who was the head villian on The Smurfs":"Gargamel","Which element has the symbol FE":"iron","Pot Luck : What is the pupa of a moth or butterfly in a cocoon called":"chrysalis","Lyrics: Darlin' in my wildest dreams I never thought I'd go":"Harden My Heart Quarterflash","TV/ Movies: Name one of the major stars in \"nashville\"":"scott glenn","TV/ Movies: Born Feb 22, 1975, She starred in this movie: Firestarter - 1984":"drew barrymore","Name The Year: Malawi (then Nyasaland) gains independence from Britain (Natl Day).":"1964","Quotations : _______ is a relentless master. It has no present only the past rushing into the future. To try to hold fast is to be swept aside.- John fitzgerald Kennedy":"history","UnScramble this Word:  a y e t r m s":"mastery","Useless Trivia: Antarctica's residents are ---------- and support staffs who usually stay no more than a year at a time.":"scientific","What process does animal hide have to undergo to become leather":"tanning","What nba team chose Dominique Wilkins as their first round draft pick":"utah jazz","Category: Science : How many degrees does the earth rotate each hour":"fifteen","This animal is armed with bony plates & rolls up into a ball if frightened":"armadillo","Who was the first president born in a hospital":"jimmy carter","Baby Names Beginning With \"M\":  Meaning: Protector from the Sea":"meredith","Are barnacles plant life or animals":"animals","Word Play : Something free of charge":"buckshee","Name The Year: 26th Olympic Summer games opens in Atlanta, Georgia.":"1996","What do the skunk, magpie and otter have in common they are all":"black and white","Acronym Soup: O ":"over [to you]","In Christian churches, the universal rite of initiation, performed with water.":"baptism","Baby Names Beginning With \"L\":  Meaning: Lion":"leone","UnScramble this Word:  a n a k s s":"kansas","Which buff coloured cotton comes from China":"nankeen","What is the name for the creamy liver of lobster eaten as a delicacy":"tomalley","Pot Luck : What is anaemia":"iron deficiency","TV Film and Stage : In which city was the first live color network telecast made in 1953":"Boston","What children's book did Forrest Gump keep in his suitcase":"Curious George","Pot Luck : With which group is Keith Flint the lead singer":"prodigy","The first mass production began in 1808, what was the product":"wooden pulley blocks","Does a person's heart rate increase or decrease during exercise":"increase","TV Film and Stage : Which TV network premiered Married With Children and the Tracey Ullman show in 1987":"Fox","Music : Who recorded Save the Last Dance for Me in 1960":"drifters","Music artists: who did \"i don't like mondays\" in 1979":"boomtown rats","TV Film and Stage : Who plays the part of Inspector Gadget in the film Gadget":"matthew broderick","Mythology : In mythology which King of Cyprus fell in love with a statue":"pygmalion","Baby Names Beginning With \"G\":  Meaning: To Profit":"gainell","'Paper Lace' told Billy not to be a hero in which year":"1974","TV/ Movies: the final dance number always had lots of bubbles":"lawrence welk show","Geography : In which country would you find the Vaiont dam":"Italy","Nebraska what is the mascot of the u.s naval academy":"goat","What is the fear of standing or walking known as":"stasibasiphobia","Pot Luck : Which town stands at the mouth of the Great Ouse":"kings lynn","Name The Year: Lunar Orbiter 1 takes first photograph of earth from the moon.":"1966","Carbonated soda water was invented in 1767, 1768 or 1769":"1767","Category: DC Secret Identities: Arthur Curry":"aquaman","Science and Technology : With what day does a month start if it has a friday 13th":"sunday","Name The Year: Hans Christian Oersted, physicist, chemist":"1777","Atlanta 1996 Olympics: This countries medal tally was: 0  Gold, 1  Silver, 2  Bronze, 3 in Total":"austria","Thomas Cook the travel agent was born in what year":"1808","Which films are about the corleone family":"the godfather","Sport and Leisure : Which capital city was scheduled as second choice to hold the 1944 Summer Olympics and had to wait for another twelve years":"helsinki","Baby Names Beginning With \"O\":  Meaning: The Odyssey":"odessa","Science and Technology : This planet takes 164.8 years to orbit around the sun":"Neptune","Geography : Whats the state bird of utah":"sea gull","Which East African leader gave himself the title of 'Conqueror of the British Empire'":"idi amin","Sport and Leisure : Baseball - the Boston Red______":"sox","A vicious one of these is a series of reactions that compound an initial problem":"circle","Raspberry, dewberry and blackberry are all members of what family":"rose","What is french national anthem":"marseillaise","Science and Technology : In the periodic table Gd is":"Gadolinium","Which peculiar bird had a shoe-polish named after it":"kiwi","Useless Trivia: ---------- of vitamin C in brussels sprouts will be lost in cooking.":"90%","Geography : The Panama canal connects the pacific Ocean and which other body of water":"caribbean sea","Pot Luck : What is the title of the sequel to the book Gentlemen Prefer Blondes by Anita Loos":"gentlemen marry brunettes","TV Film and Stage : In the movie The Goonies what brand of candybar did Chunk try to give to Sloth":"Baby Ruth","History : With what country was catherine the great associated":"russia","Mathematics : What is a triangle with two equal sides called":"isosceles","Geography : In what country is the source of the blue nile":"ethiopia","Greek gods of mythology: which goddess personified the earth":"gaea","Music : Master of puppets was performed by":"Metallica","Acronym Soup: W8ING ":"waiting","TV/ Movies: Hollywood: Actress who said, \"You know how to whistle...put your lips together-and blow\"":"lauren bacall","Music : What musical term means slowely and stately":"largo","Lyrics: I know you're not mine anymore-anyway-anytime":"I Keep Forgettin' Michael McDonald","Aussie Slang: Do the lolly":"to get very angry","What organization did Benjamin Chavis take over as head in 1993":"naacp","Category: Physics : True Or False: Contrary to popular belief, a lightbulb actually absorbs darkness":"false","TV/ Movies: 1953: won Best Picture, Director, and Supp Actor and Supp Actress":"from here to eternity","A castrated horse":"gelding","What is the square root of one quarter":"one half","Acronym Soup: NYP ":"not your problem","Geography : In which country would you find the The Trump Building":"USA","What does 'Alma Mater' mean":"bountiful mother","Traumatophobia is a fear of ______":"injury","Pot Luck : Who could distinguish 140 forms of tobacco ash":"sherlock holmes","TV/ Movies: Born Nov 19, 1962, She starred in this movie: The Silence of the Lambs - 1991":"jodie foster","Which band recorded the live album 'Strangers in the Night'":"ufo","Music : My Best Friends Girl was performed by":"Cars","In 1969 Erika---------- , actress (Under Siege, Beverly Hillbillies), born. ":"eleniak","Baby Names Beginning With \"B\":  Meaning: Green Jewel":"beryl","Geography : Which Country is known as the Hashemite Kingdom":"jordan","Lyrics: What's your definition of dirty baby":"I Want Your Sex George Michael","Religion : According to the bible how long did it take god to create the universe":"six days","What animal is found on the flag of Sri Lanka":"lion","Name The Year: Irish Republic comes into existence.":"1949","Pot Luck : The longest suspension bridge in the world is the Akashi Kaikyo located where":"japan","After WW I what was Hitler promoted to in rank":"corporal","Baby Names Beginning With \"J\":  Meaning: Praise or Jewish Woman":"judith","What does iron deficiency cause":"anaemia","Art Culture and Literature : Among the fifty-two _______ churches Sir Christopher Wren created from 1670 to 1711 the greatest was St. Pauls Cathedral":"london","What U S city is home to the Pentagon":"washington","Second city: Salt Lake City (state)":"west valley city","Category: Literature : From which Shakespeare play is this line taken: Goodnight, goodnight! parting is such sweet sorrow, That I should say goodnight till it be morrow.":"romeo and juliet","TV/ Movies: First Class Flicks: Con artist & his young pal formulate elaborate swindle.":"the sting","In what year did the Cold War begin":"1946","TV/ Movies:  who played woody in \"cheers\"":"woody harrelson","If you were born on 30 May what star sign (Zodiac) would you be":"gemini","Pot Luck : What vegetable is the essential ingredient in borsch":"beetroot","Science and Technology : Britains first space rocket was launched in 1964. What was it called":"blue streak","Category: Sci Fi Authors: Creator of the Dune series...":"frank herbert","The Hawaiian alphabet has how many letters?":"12","Pot Luck : Born in 1908, CEO and founder of the worlds largest cosmetics company":"Estee Lauder","18th century French dance":"gavotte","What is the longest tunnel":"water supply tunnel","Pot Luck : Who wore clothes made of camels hair":"john the baptist","Category: History : Who is \"The Iron Lady\"":"margaret thatcher","Baby Names Beginning With \"S\":  Meaning: Severe":"severino","Which is the only living bird with two toes on each foot":"ostrich","What lake is approximately 394,000 sq km":"caspian sea","What is the fear of home surroundings or house known as":"oikophobia","TV/ Movies: Category: Movie Tag Lines 2: 1997: In 1977, Sex was safe. Pleasure was a business. And Business was booming.":"boogie Nights","History : Australian aircraft carrier collided with US destroyer Frank E Evans in half killing 74. South Vietnam in 1969.  What was the name of the carrier":"Melbourne","Category: Geography : What is the capital of Mauritania":"nouakchott","Name The Year: Martha Place of Brooklyn, became first woman to die by electrocution.":"1899","UnScramble this Word:  r a t m u e r":"erratum","Food and Drink : What did north american indians eat to dissolve gravel and stones in the bladder":"watercress","Name The Year: Greece gains it's independence.":"1821","Salad of sliced raw cabbage,carrot and apple":"coleslaw","African tree with massive trunk and edible fruit":"baobab","Music : What It Takes was performed by":"Aerosmith","James Hepburn, the fourth Earl of Bothwell, died in 1578. Who did he marry in 1567?":"Mary Queen of Scots","History : Louis xvi was guillotined in which year":"1793","Quotations: \"Choose your friends by their character and your socks by their color. Choosing your socks by their ---------- makes no sense, and choosing your friends by their color is unthinkable.\"- Anon.":"character","TV/ Movies: Born Oct 1, 1935, She starred in this movie: Victor/Victoria - 1982":"julie andrews","What gas did Joseph Priestley discover in 1774":"oxygen","Pot Luck : What is the last word of the old testament":"curse","What small island is in the bay of naples":"isle of capri","Music : Barely breathing was performed by":"Duncan sheik","In what year was Houdini born":"1874","Music : What I Like About You was performed by":"Romantics","In which year did the American Civil War end":"1865","Acronym Soup: PTO ":"please turn over","Word Play : Potamophobia is a fear of what":"rivers or running water","Pot Luck : Where in the world would you find Adelie Land":"antarctica","Name The Year: Jean Harlow, sex goddess of the 30s, born.":"1911","Music : Wheres The Love was performed by":"Hanson","In 1770 Ludwig von ---------- (in Bonn, Germany), composer, born. ":"beethoven","An oxlike antelope":"gnu","What is the word used to describe species that are not extinct":"extant","On what date did \"The Wall\" fall?":"1989","Quotations : China is a big country inhabited by many _______.- Charles De Gaulle (1890 - 1970)":"chinese","Pot Luck : To what group of elements do cerium praesiodymium and promethium belong":"rare earths","UnScramble this Word:  i y n i e i s t b l s":"sensibility","In what year was Guy Fawkes arrested":"1605","Pot Luck : Which day is the first day of Holy Week in the Christian calendar":"palm sunday","Pot Luck : What structure in the back of the brain governs motor control":"cerebellum","UnScramble this Word:  h e k d e c e":"cheeked","Napoleon had connections with three islands, he was imprisoned on Elba and died on St. Helena, where was he born?":"Corsica","Who crashed out of the 1995 Tour de France after just 92 seconds":"chris boardman","Brussels is the capital of _______":"belgium","Books: who wrote the book \"wouldn't take nothing for my journey now\"":"maya","TV/ Movies: 1932 - Gary Cooper - Starred In This Movie: ":"if i had a million","What US academy is located in Kings Point, New York":"us merchant","Category: Sport : The 1976 Summer Olympics were held in this city.":"montreal","Music : Sunglasses At Night was performed by":"Corey Hart","What's the capital of Vermont":"montpelier","Nature and Biology : The mouse is the most common mammal in the _______":"united states","Science and Technology : How many days long is a year on the planet Mercury":"eighty eight","Lyrics: See yourself give your freewill a chance you've got to work to succeed":"Owner of a Lonely Heart Yes","Word Play : What is the fear of certain fabrics known as":"textophobia","Baby Names Beginning With \"S\":  Meaning: Star":"stella","Whose patron is St Nicholas":"sicily","Word Play : dont switch horses in":"midstream","In 1977 ---------- Callas American-born prima donna dies in Paris at 53. ":"maria","Word Play : What name is given to sweet chestnuts preserved in syrup":"marrons glace","Which was the first US city to stage the summer Olympics":"st louis","Where was 'g.i joe' introduced on february 9, 1964":"annual american","Geography : What is the capital of Gambia":"Banjul","Lyrics: All the doors I closed on time will open up again":"Back In The High Life Again Steve Winwood","Pot Luck : What is the metal part of a lamp surrounding the bulb and supporting the shade":"harp","Mythology : In arabian mythology what is the spirit of a murdered man seeking to avenge his death":"afrit","Name The Year: Belle Starr, entertainer of the wild west, born.":"1848","Animal Trivia: In Milwaukee during the 1900s, 12,500 horses in the city left an estimated 133 tons of ---------- and urine on the streets per year.":"manure","Art Culture and Literature : In Clive Barker books - To the Seerkind normal people are known as _______ (Weaveworld)":"cuckoos","1992 - What british actor penned the autobiography 'What's It All About'":"Michael Caine","Pot Luck : Which is Britains largest native carnivore":"badger","What word links these: dress, lock, night":"shift","The temperature at what dew forms is called the":"dew point","Sport and Leisure : Which Olympics did the US boycott":"980","Wwhat is the name of Mulder and Scully's supervisor on the X-files?":"Walter Skinner","TV/ Movies: 1956 - Shirley MacLaine - Starred In This Movie: ":"around the world in 80 days","TV/ Movies: Category: Pulp Fiction: waiter for mia and vincent is what singer":"buddy holly","Pot Luck : What organisation did C T Russell found":"Jehovah Witnesses","Pot Luck : Which mountain is the highest in the Alps":"mont blanc","Category: Pinball: This 1988 Lawlor game has a vertical playfield instead of a normal backglass":"banzai run","Religion : Of which country is voodoo the national religious folk cult":"haiti","Useless Trivia: Approximately 16 Canadians have their ---------- removed when not required, everyday.":"appendixes","What was the basis of the giant u.s prune industry":"agen plum","Nature and Biology : A group of walkingsticks is called a":"swarm","TV/ Movies: 1983 - Julie Andrews - Starred In This Movie: ":"the man who loved women","In the tv series 'the fall guy', who played colt seavers":"lee majors","What french phrase means 'well informed'":"au courant","Music : Cradle of Love was performed by":"Billy Idol","Religion : What is a person who has made a pilgimage to mecca":"hajji","In 1582 Gregorian calendar introduced in---------- , other Catholic countries. ":"italy","What is the capital of mali":"bamako","Pot Luck : What is LCD an abbreviation of":"liquid crystal display","TV/ Movies: Television   the wizard of ____":"oz","UnScramble this Word:  m s d d d i u":"diddums","Whats the capital of Bermuda":"hamilton","Pot Luck : Who drinks the most tea per capita":"ireland","TV/ Movies: TV Transpo: Name That Show: Murray, Cody, Nick & RoboBoz live on a boat & solve crimes.":"riptide","Who captured esquire's 'most dubious man of the year' award in 1980":"billy","What note has a time value of two crotchets":"minim","Word Play : Of what is hippophobia a fear":"horses","Category: Trivia : Who invented logarithms":"john napier","Pot Luck : The Merry Man and his Maid is the alternate title for which Gilbert and Sullivan operetta":"yeoman of the guard","TV/ Movies: Category: Gen X TV: Before coming to WKRP, Johnny Fever got fired for saying what word on the air":"booger","TV/ Movies: Born July 13, 1942, He starred in this movie: The Conversation - 1974":"harrison ford","UnScramble this Word:  d s e d l g u":"guddles","Pot Luck : Who wasnt afraid to call James Joyce A greasy undergraduate":"virginia wolfe","Sydney 2000 Olympics: This countries medal tally was: 0 Gold, 1 Silver, 0 Bronze, 1 in Total":"vietnam","Category: Original Titles: 1805 by Leo Tolstoy":"war and peace","Which 19th Century poet was known as 'The Bard of Rydal Mount'":"william wordsworth","Politics : What is a military governer in japanese":"shogun","Pot Luck : Which famous talk show host made a guest apearence on Laverne and Shirley":"Jay Leno","With which sport would you associate Alberto Tomba":"skiing","What did the Oshkosh steamer win":"first automobile race","TV/ Movies: Who won the Oscar for best ACTRESS in a Leading Role in 1943 16th Academy Awards for the Movie THE SONG OF BERNADETTE":"jennifer jones","In 1895 Louis ---------- dies. ":"pasteur","Nature and Biology : A large sea bird but also means a greedy person":"gannet","In 1758 Wilhelm---------- , discoverer of asteroids Pallas and Vesta, born. ":"olbers","UnScramble this Word:  m y o d o":"moody","In 1903 Eliot Ness  ---------- (FBI agent-Chicago), born ":"untouchable","How did Virginia Woolf die":"committed suicide","Category: Sports Actors: Besides Field of Dreams, what other baseball movie starred Kevin Costner":"bull durham","What is 'confederatio helvetica' in english":"helvetic confederation","Baby Names Beginning With \"U\":  Meaning: Light":"urit","Music : Africa was performed by":"Toto","Baby Names Beginning With \"Z\":  Meaning: Vigorous, Alive":"ziven","TV/ Movies: Madonna and Eurythmics share this song title; also a 1987 movie Madonna was in.":"whos that girl","Music : Is There Something I Should Know was performed by":"Duran Duran","In 1964 China becomes world's ---------- nuclear power. ":"5th","music:  who recorded \"too much\"?":"elvis presley","TV Film and Stage : Who played Annie Walker in Coronation Street":"doris speed","Name the three main bands featured on the cartoon series 'Jem' during it's entire 3 year run.":"Jem and The Holograms,The Misfits,The Stingers","From where is the music for the 'star spangled banner'":"anacreon in heaven","What are wrapped in rashers of bacon to make the dish Angels on Horseback":"oysters","Science and Technology : In approximately what year was steel first made":"five hundred bc","TV/ Movies: How was the virus transmitted in the movie 'Outbreak'":"through the air","Art Culture and Literature : Who wrote The Ground Beneath Her Feet":"salman rushdie","Pot Luck : What nba team chose Dominique Wilkins as their first round draft pick":"utah jazz","Mythology : Who did Hercules persuade to go and get the Golden Apples for him":"atlas","Who taught alexander the great":"aristotle","History : Joseph Farwell Glidden born in 1813, invented what":"barbed wire","TV Film and Stage : Which astronaut did Tom Hanks play in the film Apollo 13":"jim lovell","Pot Luck : Whats a Sultans wife called":"sultana","History : What was the nationality of the prisoners in the Black hole of Calcutta":"british","Who was the roman god of the sea":"neptune","What is the Capital of: Sudan ":"khartoum","What was landscape gardener Lancelot Brown's nickname":"capability","TV Film and Stage : Midnight ___":"Run","In 1959 Soviet ---------- becomes first human-made object to crash on moon. ":"lunik 2","History : What derogatory name is derived from a remark given by the Kaiser to members of the British Expeditionary Force under Sir John French in 1914":"old contemptibles","Word Play : When two words are combined to form a single word (e.g. Motor + hotel = motel or breakfast + lunch = brunch) what is the new word called":"portmanteau","Geography : In which UK county does the River Mersey rise":"derbyshire","Pot Luck : What was the secret identity of captain america":"steve rogers","80s Films: \"In the Southeast, they say if you want to go to heaven, you have to change planes in Atlanta.\"":"Accidental Tourist","Eddie and his father's last name in \"The Courtship of Eddie's Father\"":"corbett","Authors: The Old Man and the Sea":"ernest hemingway","What color are a zebra's stripes during the first six months of life?":"brown","Acute, infectious, contagious disease of the respiratory tract, especially the trachea":"Influenza","\"It's a Shame About Ray\" was released in 1992 and rereleased later with a cover of Simon and Garfunkel's Mrs Robinson. which band was it":"Lemonheads","What does thumper call ice in \"bambi\"":"stiff water","UnScramble this Word:  r d o n u":"round","Lyrics: I'll be stretching my mouth to let those big words come right out":"Big Time Peter Gabriel","TV/ Movies: Born Mar 10,1958, She starred in this movie: Diabolique - 1996":"sharon stone","Baby Names Beginning With \"K\":  Meaning: Wooden Post":"keran","Sport and Leisure : Baseball - The Florida ______":"marlins","History : Christopher Columbus signs contract with the king of which country to find the westernly approach to the country of India in 1492":"Spain","TV/ Movies: Category: Dick Van Dyke Show: What phrase did Laura utter whenever she was in trouble or upset":"oh rob","TV Film and Stage : Who played Johnny Yuma in the series The Rebel":"nick adams","Pot Luck : Where is Londons whispering gallery":"st pauls cathedral","Leaflike part of plant growing before flower":"bract","Category: Science : A shallow dish with a cover, used for science specimens is a(n) ________.":"petri","UnScramble this Word:  e r l e f":"fleer","Baby Names Beginning With \"B\":  Meaning: Location Name":"bisbee","AUTHORS: Who wrote The Exorcist":"william peter blatty","TV/ Movies: Who coupled with the Devil and gave birth to Andrew John":"rosemary","Art Culture and Literature : In Shakespeares play who was the wife of Othello":"desdemona","Name The Year: National Socialist (Nazi) Party formed in Germany.":"1919","UnScramble this Word:  r a g l t u p o":"portugal","Acronym Soup: AFK":"away from the keyboard","Word Play : Unscramble snieo":"noise","Pot Luck : Which word can preceed all these - humor mannered suited health":"ill","TV/ Movies: Born Sep 28, 1934, She starred in this movie: The Truth - 1960":"brigitte bardot","Category: Alcohol: The German New Year's carnival":"fasching","What major league baseball team has a moose for a mascot":"the seattle mariners","Geography : Sedimentary and igneous are types of what":"rock","UnScramble this Word:  t e w t y n":"twenty","Concordia is the roman goddess of ______":"harmonious relations","TV/ Movies:  who created star trek":"Gene Roddenberry","TV/ Movies: 1999, This Movie was Released on February 26 Just the ---------- ":"ticket","Sport and Leisure : Which US tennis star was born in 1970":"Andre Agassi","TV/ Movies: Who won the Oscar for best ACTRESS in a Leading Role in 1979 52nd Academy Awards for the Movie NORMA RAE":"sally field","Quotations : A _______ is a person who works hard all his life to become known then wears dark glasses to avoid being recognized.- Fred Allen (1894 - 1956)":"celebrity","Which song did the easybeats record that everyone sang at the end of a work week":"friday on my mind","What three numbers divide into nine evenly":"one, three, nine","History : Which fort did Custer depart from on May 17 1876 with the Seventh Cavalry on his way to the Little Big Horn":"Fort Abraham Lincoln","In what epic film did charles laughton play quasimodo":"the hunchback of notre","TV/ Movies: Born Aug 17, 1943, He starred in this movie: Raging Bull - 1980":"robert de niro","Pot Luck : Whose campaign warned a vote for and erson is a vote for Reagan":"jimmy carter","TV/ Movies: 1958 31st Academy Awards: Best Actress In A Leading Role Was Won By Susan Hayward For The Movie:":"i want to live!","UnScramble this Word:  e o a l n":"alone","Geography : Term applied to a migratory people of southern China":"Hakka","The literal translation for the swedish word 'smorgasbord' is \"board for ______________(two words)":"buttered bread","What does BMW stand for?":"Bavarian Motor Works","In 1945 John Lithgow, actor (Harry and the Hendersons,---------- ), born. ":"3rd rock from the sun","What cocktail is made from vodka and kahlua":"black russian","Pot Luck : What soft white sweets can be roasted over a fire":"marshmallows","Art Culture and Literature : Who wrote Hotel":"arthur hailey","TV/ Movies: 1961 - Ingrid Bergman - Starred In This Movie: ":"goodbye again","What was the name of Minnie Caldwell's cat in Coronation Street":"bobby","Useless Trivia: Bret ---------- trademarked the nickname 'Hitman' in 1990.":"hart","Music : Torn was performed by":"Natalie Imbruglia","Politics : Who received the nobel peace prize in 1964 for civil rights leadership":"martin luther king jr","UnScramble this Word:  r s s s u e b l":"brussels","TV/ Movies: What was the name of the bumbling patrolman on \"odd couple\"":"murray greschler","Nature and Biology : What is a group of ponies":"string","Useless Trivia: A bolt of lighting can strike the earth with a force as great as ---------- volts.":"100 million","Pot Luck : Which horticultural fungicide consisting of equal parts of copper sulphate and lime bears the same name as a French port":"bordeaux mixture","Category: Magic Gathering: The First Magic book":"arena","TV/ Movies: 1983 - Meryl Streep - Starred In This Movie: ":"silkwood","Nature and Biology : A group of aoudad is called a":"herd","TV/ Movies: What 1951 film featured ronald reagan raising a chimp":"bedtime for bonzo","Word Play : Unscramble lema":"meal","History : American pioneer who was killed while defending the Alamo":"James Bowie","TV/ Movies: 2000, This Movie was Released on April 28 ---------- ":"time code","What cartoon characters are at 6 flags theme park":"looney tunes","In 1943 Eisenhower and Italian Marshal ---------- Badoglio sign an armistice. ":"pietro","Who is the patron saint of paper makers":"st john the evangelist","Baby Names Beginning With \"T\":  Meaning: Myth/Legend":"taru","TV/ Movies: 007:who sang the title song in the movie \"never say never again\"":"lani hall","AUTHORS: Who wrote The Plague Dogs":"richard adams","UnScramble this Word:  d e s c u s r a":"crusades","In 1944 Barry---------- , singer, born. ":"white","Who wrote the classic thriller 'The Birds'":"Alfred Hitchcock","What geological period followed the Jurassic":"cretaceous","Geography : What is the name of a quarter of jerusalem that can be translated as hundred gates":"mea shearim","Music : Who recorded the lengthy song : In-A-Gadda-Da-Vida in 1969":"iron butterfly","AUTHORS: Who wrote A Time to Kill":"john grisham","In which Charles Dickens novel does Herbert Pocket appear":"great expectations","UnScramble this Word:  i t i i f y n n":"infinity","Word Play : Verbophobia is a fear of what":"words","Which Indonesian fruit is known for its unpleasant smell":"durian","On One Day at a Time,what were the two daughter's names?":"Barbara and Julie","Word Play : In pottery what is tiny cracks in the glaze called":"crackle","Category: Science : A phrenologist reads _________.":"skulls","Food and Drink : the beer Oldenberg comes from which US state":"kentucky","TV Film and Stage : Charles Laughton played Quasimodo in this epic film":"hunchback of notre dame","How old was roy roger's horse trigger when he died":"thirty three","What do airplane mechanics refer to as 'pickle juice'":"motor oil","Name The Year: (USA) \"Tarzan,\" one of the 1st adventure comic strips, 1st appears.":"1929","Religion : What are religious ascetics who practise scourging or mutual whipping for bodily discipline or penance":"flagellants","Which character did David Jason play in the T.V. series Porridge":"blanco","TV/ Movies: What famous film did actor bela lugosi not finish filming due to his death":"dracula","Name The Year: Jackson Pollock abstract artist, dies in auto accident (East Hampton).":"1956","Nature and Biology : When a school of baby _______ are threatened their father opens his huge mouth and the youngsters swim inside to hide. When danger has passed he reopens his mouth and lets the fry out":"catfish","Blossoms 'now look at them yo-yo's, that's the way you do it ..' what is the dire straits song title":"money for nothing","TV Film and Stage : In the wizard of oz what was dorothys dogs name":"toto","Who was disqualified after winning the 1976 british grand prix":"james hunt","Name The Year: C.S. Forester, historical novelist, created Horatio Hornblower":"1899","Nature and Biology : This type of insect is named after a month":"june bug","Geography : What is the capital of Benin":"Porto-novo","Pot Luck : What us general was known as old blood and guts":"George S Patton","From what is rum distilled?":"Sugar cane","What was the symbol for the house of lancaster":"red rose","Nature and Biology : What is a group of caterpillars":"army","TV/ Movies: 1943 16th Academy Awards: Best Actress In A Leading Role Was Won By Jennifer Jones For The Movie:":"the song of Bernadette","What's the better known name of the card game twenty one":"blackjack","In 1846 ---------- Galle and Heinrich d'Arrest find the planet Neptune. ":"johann","Music : Your Song was performed by":"Elton John","Food and Drink : In McDonalds - What is their large morning meal with Eggs Sausage Hash Browns etc called":"big breakfast","Science and Technology : Physics : The process of water changing to water vapor is known as _______":"evaporation","Art Culture and Literature : Which Charles Dickens novel was brought to the screen by David Lean":"oliver twist","Pot Luck : Which breed of dog was introduced to Britain from Seistan province of Persia by John Barff who exhibited it at the Kennel Club in 1907":"afghan hound","Pot Luck : What is the name of the peoples car":"volkswagen","UnScramble this Word:  u u m r e b c s c":"cucumbers","Useless Trivia: ---------- gas can often be seen bubbling up from the bottom of ponds. It is produced by the decomposition of dead plants and animals in the mud.":"methane","Name The Year: Golda Meir became prime minister of Israel.":"1969","In the film version of Willy Russell's play, who played Shirley Valentine":"pauline collins","Music : Best Of My Love was performed by":"Eagles","TV/ Movies: Category: Brady Mania: She crashed her bicycle in the garage when she wasn't wearing glasses.":"jan","Geography : What is the US capital of Arkansas":"Little Rock","Geography : What country did Germany invade on September first 1939":"poland","In 1941 First German ship in WW2 captured by US ship (---------- ). ":"busko","TV/ Movies: On what cartoon show did the characters watch tv on station bdrx":"flintstones","Nature and Biology : What do we call the noise made by a sudden spasm closing the windpipe":"hiccup","What was Paul Tibbett's claim to fame, established on August 6th 1945":"pilot of the plane which dropped atom bomb on hiroshima","Pot Luck : Which is the longest bone in the body":"femur","Name The Year: Mary Wollstonecraft Shelley London England, author (Frankenstein), born.":"1797","Baby Names Beginning With \"N\":  Meaning: Messenger":"nuncio","Music: Who recorded the 1967 hit song \"Groovin\"":"young rascals","In 1962 ---------- Elwes, actor (Glory, Princess Bride, Robin Hood - Men In Tights), born. ":"cary","Pot Luck : Type of frothy milky coffee":"cappuccino","What is a group of herring":"army","In what year was Darwins 'Origin of the Species' published":"1859","Name The Year: Timothy Dalton, actor, James Bond #4, born.":"1956","Name The Year: Niger gains independence from France.":"1960","Who succeeded Caligula as Roman Emperor":"claudius","Music : Ill Always Love You was performed by":"Taylor Dayne","Religion : Complete the couples - Samson and _______":"delilah","TV/ Movies: 50s Flicks: Which French star appeared in _and God Created Woman_, set in St. Tropez ":"brigitte bardot","Nature and Biology : What animal may be stag rhinoceros or dung":"beetle","Word Play : What does the prefix pseudo mean":"pretend","Music: What is Ozzy Osbourne's real first name":"John","Nature and Biology : What are social birds that congregate in huge flocks. While the flock grazes in a field lookouts will be posted to watch for approaching danger. Theyll raise the alarm if humans approach":"crows","Acronym Soup: PGP ":"pretty good privacy","Quotations : Im the only Western reporter here in Baghdad":"peter arnett","Who said 'what, me worry'":"alfred e neuman","Nature and Biology : A small herring or sprat":"brisling","Who wrote the book 'Portrait of a Lady'":"henry james","Science and Technology : The first atom bomb was dropped on which Japanese city":"Hiroshima","Nature and Biology : Which garden plant has varieties called Nelly Moser and Hagley Hybrid":"clematis","Pot Luck : Which austere Christian sect founded in 1650 rejects cultural rites and an ordained ministry":"quakers","Pot Luck : Every person generates approximately 3.5 pounds of rubbish a day what is the most common material":"paper","Hoplophobia is the fear of":"firearms","In 'a christmas carol', how many ghosts visited scrooge":"four","In 1983 Sixth Space Shuttle Mission -  ---------- returns to Earth.":"challenger 1","Acronym Soup: JTYMLTK ":"just thought you might like to know","What is the Capital of: Sierra Leone ":"freetown","Geography : The Arctic ocean is the smallest and _______":"shallowest","In 1899 George ---------- wins patent for his golf tee. ":"grant","UnScramble this Word:  q e e e z s u":"squeeze","In 1956 ---------- Fisher (in Beverly Hills), actor (Star Wars, Blues Brothers), born. ":"carrie","Politics : Who becames premier of France in 1958":"Charles de Gaulle","Food and Drink : The foodstuff carambola is known by what alternative name":"starfruit","What is the young of this animal called: Bear":"cub","80s Films: Fatal ___":"Attraction","Art Culture and Literature : Noble House can be found in this British colony":"hong kong","UnScramble this Word:  e i n a r g l d n":"leningrad","What are fawn or pale brown cows called":"jersey cows","Baby Names Beginning With \"B\":  Meaning: A Blessing":"bracha","Name The Year: Dr Peter Goldmark of CBS demonstrates \"long playing record\", Columbia commits to 33 1/3 rpm records, plans to phase out 78's.":"1948","Useless Trivia: ---------- phone calls will be misplaced by telecoms service every minute.":"1,314","What is the name for music that is transmitted orally or aurally (taught through performance rather than with notation, and learned by hearing)":"folk music","TV Film and Stage : What US state gave the world Louis Armstrong Fats Domino Mahalia Jackson and Jelly Roll Morton (and dare I say Britney Spears)":"louisiana","What is the sum of  99 - 33 - 33 - 33":"zero","TV/ Movies: Category: Entertainment: Comedy troupe of John Cleese, Michael Palin, Eric Idle, and others.":"monty python","Name The Year: Mickey Mantle announces his retirement.":"1969","Nature and Biology : From which plant family do vanilla pods come":"orchid","A breed of black and white dairy cattle":"friesian","TV/ Movies: On the set of Jaws what was the nickname given to the shark":"bruce","New jersey has a spoon featuring over _________spoons from every state and almost every country":"five thousand four hundred","Word Play : Complete : if _______ was shorter the face of the world would be changed":"cleopatras nose","In 1797 Henry Engelhard---------- , piano maker, born. ":"steinway","TV/ Movies: Category: Disney Afternoon: What is the usual length of The Disney Afternoon":"two hours","Useless Facts: The ------- Indian language was used successfully as a code by the United States in World War II.":"navajo","Geography : What country was called Botany Bay and New Holland until 1820":"australia","Tanzania is the country that resulted from the union of zanzibar and ______":"tanganyika","Music : Who released the smash hit she drives me crazy":"fine young cannibals","In 1833 Alfred Bernhard ---------- (in Stockholm, Sweden), created dynamite and Peace Prizes, born. ":"nobel","Name The Year: Lon Chaney, actor, man of a thousand faces, born.":"1883","Pot Luck : When was d-day":"june 6 1944","Nature and Biology : In what year was the first test tube baby born":"1978","Useless Trivia: Leon Trotsky, the seminal Russian Communist, was assassinated in Mexico with an---------- .":"icepick","Geography : Bangkok is which countrys capital":"thailand","With what is a diamond cut if it forms graphite dust":"laser","TV/ Movies: What designation appears on Entertainment Tonight microphones":"letters et","Pot Luck : In dating agency adverts what does the S represent in the abbreviation NSP":"smoker","Plant with edible fruits in red green and yellow":"capsicum","History : What did the Chinese hate to be referred to as":"silk people","TV Film and Stage : Who directed the films La Strada and La Dolce Vita":"fellini","UnScramble this Word:  e t i a z m s":"mestiza","Who wrote the opera \"the Thieving Magpie'":"rossini","Art Culture and Literature : Stephen King - Maine city which King calls his home":"bangor","UnScramble this Word:  s t v n i a e":"naivest","In 1387---------- , king of England (1413-22), born. ":"henry v","What is produced by putting a whole \"maris piper\" in an oven until it goes soft inside":"baked potato","Category: Easy People: In which revolution was Emiliano Zapata an important figure":"mexican revolution","TV/ Movies: Born Dec 31, 1937, He starred in this movie: The Road to Wellville - 1994":"anthony hopkins","Baby Names Beginning With \"K\":  Meaning: Pure of Heart":"kari","Baby Names Beginning With \"M\":  Meaning: Tuesday":"mardi","Geography : What is the only country in the world that starts with the letter O in English":"oman","Nature and Biology : Which plant has gills a veil and scales":"mushroom","Music:What completes the title of this Oasis album \"Definitely...":"maybe","In 1870 Robert E Lee General of the ---------- Army, dies at 63. ":"confederate","Category: Cars: Combine a Van &  a Car &  you get this word.":"caravan","Politics : Who was the last communist leader of East Germany":"egon krenz","Category: Not Telling ;-P : What are white dwarfs and red giants":"stars","TV/ Movies: Category: ActPersons: The birthplace (city) of Sidney Poitier.":"miami","Category: Character Creators: Dracula":"bram stoker","Baby Names Beginning With \"A\":  Meaning: Source of all Life":"axel","TV/ Movies: 1991 - Demi Moore - Starred In This Movie: ":"nothing but trouble","Useless Trivia: Rhinos are in the same family as---------- , and are thought to have inspired the myth of the unicorn. ":"horses","TV/ Movies: Category: Actor In The Role: Josef Mengele in 'The Boys from Brazil'":"gregory peck","Art Culture and Literature : In what year was Gullivers Travels published":"1726","History : One who fought professionally in Roman arenas was a _______":"gladiator","Which kitchen appliance was invented by fred waring":"blender","TV/ Movies: 1963 36th Academy Awards: Best Actress In A Leading Role Was won by Patricia Neal For The Movie:":"hud","Politics : In what year was John F Kennedy married":"1953","What Apple Computer cofounder sponsored the US Festival":"steve wozniak","Word Play : Complete : this saying As sly as a ______":"fox","Name The Year: Hungarian National Day.":"1945","TV Film and Stage : John McClane was fighting terrorists in a skyrise in which eighties movie":"Die Hard","Music : Show Me The Way was performed by":"Styx","In 1945 Pat ---------- (in Los Angeles), actor (Peyton Place), born.":"morrow","Baby Names Beginning With \"B\":  Meaning: Pretty, Beautiful":"bonita","Lyrics: This is the world we live in and these are the hands were given":"Land of Confusion Genesis","Architectural style developed in the Eastern Empire":"byzantine","In 1942 Actors Hume ---------- and Jessica Tandy are married. ":"cronyn","Who composed \"The Fountains of Rome\" and \"The Pines of Rome\"":"respighi","Nature and Biology : Which part of your body might suffer from a stigmatism":"eyes","Which monarch was the first to appear on a postage stamp":"queen victoria","What common allergens are the male sex cells of plants":"pollen","Sport and Leisure : In what sport are Triffus Miller and Rudolf moves":"Trampolining","TV/ Movies: What was the real name of john wayne":"marion morrison","What was the name of Vanessa's last boyfriend on The Cosby Show?":"Dabnes","Sport and Leisure : Which sport saw referee Bajina Basta banned in 1985 for thumping spectators who heckled his decisions":"Baseball","Pot Luck : What job does up and down do for a living":"elevator operator","Lyrics: Don't wish it away don't look at it like this forever":"I Guess That's Why They Call It The Blues Elton John","Pot Luck : Name the loner rebel reindeer with the red shiny nose":"rudolph","Sport and Leisure : What is san franciscos equivalent to sydneys city to surf race":"bay to","Acronym Soup: IBTD":"i beg to differ","Useless Trivia: Certain fireflies emit a light so penetrating that it can pass through ---------- and wood.":"flesh","Pot Luck : The heraldic term gules meaning red comes from the french word gueules meaning a ______":"throat","In which year did the St. Valentine's Day massacre take place in Chicago":"1929","Nature and Biology : A dogs _______ has over 200 scent receiving cells":"nose","Baby Names Beginning With \"O\":  Meaning: To Obey":"obedience","In 1791 (AUSTRIA) Wolfgang ---------- Mozart, composer, dies aged 37. ":"amadeus","Who is the egyptian goddess of love":"isis","History : How is Rodrigo Diaz de Vivar better known":"el cid","What publication was subtitled the what's new magazine":"popular science","TV/ Movies: Sci Fi Movies: A plethora of beings, including George Peppard, saves the universe.":"battle beyond the stars","The drug digitalis is obtained from which plant":"foxglove","Art Culture and Literature : Who is the abandoned man cub in The Jungle Book":"mowgli","A pork product that's often served for breakfast":"bacon","Mathematics : An angle greater than 180 degrees and less than 360 degrees is a _______ angle":"reflex","TV/ Movies: 1948 - Gary Cooper - Starred In This Movie: ":"good sam","On Three's Company,what city did the trio live in?":"Santa Monica","Pot Luck : What is the symbol of the democratic party":"donkey","Nature and Biology : What is the common name of the disease Varicella":"chicken pox","Art Culture and Literature : What is the name of Wordsworths cottage in Grasmere":"dove cottage","What is a 'hotel-dieu' in france":"hospital","Art Culture and Literature : Who is the dog on the crackerjack box":"bingo","Word Play : What is a catalogue of languages":"ethnologue","Nature and Biology : Slugs have 4 ______":"noses","Pot Luck : What was the only nation to register zero births in 1983":"Vatican City","TV Film and Stage : What TV dog had successive masters named jeff timmy and corey":"lassie","What us state has sagebrush as its state flower":"nevada","Word Play : Unscramble rtesae":"easter","TV/ Movies: Who won for directing Lawrence of Arabia (Best Picture, 1962)":"david lean","Nature and Biology : The conception and birth of the this species are odd events. Although mating usually occurs in July the embryos of the armadillo remain in a dormant state until November. Later in March four young are born":"armadillo","TV/ Movies: Who won the Oscar for best ACTRESS in a Leading Role in 1956 29th Academy Awards for the Movie ANASTASIA (1956)":"ingrid bergman","In 1965 Beatles' \"---------- !\", album goes #1 and stays #1 for 9 weeks. ":"help","History : What begins service from St. Joseph Missouri in 1860":"Pony Express","Baby Names Beginning With \"B\":  Meaning: Perfect Joy":"bliss","Geography : Which Country won the first Cricket World Cup":"west indies","What was a large cask with a lidded opening, used to hold day's supply of drinking water for a ship's crewmen":"scuttlebutt","Which london station handles trains directly to the continent, through the channel tunnel":"waterloo","Pot Luck : The pleistocene epoch of geologic time is more commonly known as ___ ___":"ice age","Gentlemen what hairstyle did chris evert sport in her first us open tennis champions":"pigtails","Art Culture and Literature : The Uffizi is a museum and art gallery in which European city":"florence","For what is ethylene glycol used in automobiles":"anti-freeze","Useless Trivia: ---------- is the study of trees.":"dendrology","Name The Year: Katie Pierson vocals/guitarist (B-52's-Rock Lobster, Love Shack), born.":"1948","Mythology : Who was Cupids earthly love":"Psyche","History : In what year was Diana Princess of Wales born":"1961","Comics and Cartoons : Betty Boo was doing the doo in what year":"1990","what is samian ware?":"fine pottery","Geography : The longest main street in America 33 miles in length can be found in Island Park _______":"idaho","In 1958 St. Clare of ---------- declared patron saint of television.":"assissi","What was the first english play written exclusively for children":"peter pan","Name The Year: Riots in Argentina after Falklands/Malvinas defeat.":"1982","The karyotype describes the number, shape and size of which structures within a cell":"chromosomes","TV/ Movies: Category: Actress In The Role: Runaway Train ---> Sara":"rebecca demornay","AUTHORS: Who wrote High Wind in Jamaica":"richard hughes","What is the real name of the murderer known either as 'The .44 Calibre Killer' or 'The Son of Sam'":"david berkowitz","Name The Year: FDR conducts his first \"Fireside Chat\".":"1936","TV/ Movies: Who won the Oscar for best ACTRESS in a Leading Role in 1928/1929 2nd Academy Awards for the Movie COQUETTE":"mary pickford","Category: 60s: He was the first president born in the 20th century.":"kennedy","Name The Year: Graham \"Suggs\" McPherson rocker (Madness-Our House), born.":"1961","Mathematics : What is the decimal equivalent of binary 1111":"fifteen","Name The Year: French revolutionary writer Jean Paul Marat murdered by Charlotte Corday.":"1793","Baby Names Beginning With \"P\":  Meaning: Of Fire":"pyralis","What is the fear of smothering known as":"pinigerophobia","Music : Johnny b good was performed by":"Chuck berry","TV/ Movies: 2000, This Movie was Released on April 28 The Big ---------- ":"kahuna","Nature and Biology : The smell of a _______ can be detected by a human a mile away":"skunk","Baby Names Beginning With \"L\":  Meaning: Hindu God":"latika","What major does david bowie's \"space oddity\" refer to":"major tom","Science and Technology : Microsoft Windows 1.0 shipped in November of what year":"1985","Music : People are people was performed by":"Depeche mode","Sport and Leisure : With which sport is Greg Norman identified":"golf","TV/ Movies: 1997 - Sigourney Weaver - Starred In This Movie: ":"alien resurrection","The science of life":"biology","Pot Luck : What is the modern name of Pok-ta-Pok which originated in Mexico":"basketball","Football the dallas ______":"cowboys","TV Film and Stage : Who played Ming of Mongo in Flash Gordon":"Max Von Sydow","Music : Welsh singer born in 1937":"Shirley Bassey","Pot Luck : What is the smallest member of the weasel family":"skunk","Category: Geography : What is the capital of Germany":"berlin","Category: Sport : Which football team was nicknamed the \"Orange Crush\"":"the  denver broncos","Music : A Face in the Crowd was performed by":"Tom Petty and the Heartbreakers","Nature and Biology : A group of people is called a":"herd","Art Culture and Literature : Over 400 films have been made based on the plays of which famous writer":"shakespeare","Geography : The international vehicle registration letters RCH denotes which country":"chile","How many times have the olympic games been cancelled due to war":"three","Nature and Biology : Gorillas and _______ sleep about fourteen hours a day":"cats","In 1819 ---------- Wieck Schumann, German pianist, composer, born. ":"clara","From who did malta gain independence in 1964":"britain","Pot Luck : What show was Just the 10 of us spin off of":"Growing Pains","Acronym Soup: RFC ":"request for comment","Art Culture and Literature : The play Our Town is set where":"grovers corners","TV/ Movies: Born Mar 10,1958, She starred in this movie: Tears in the Rain - 1995":"sharon stone","TV/ Movies: 1981 - Kirstie Alley - Starred In This Movie: ":"one more chance","Category: Legend: What does the goblin take from the stallion unicorn?":"horn","What country has the car registration letter T":"thailand","Word Play : Hereiophobia is a fear of what":"radical deviation","Art Culture and Literature : The archeologist Mallowan was married to this popular English author":"agatha christie","Geography: The Salto Alto (Angel Falls) in -------------- is the highest waterfall known. It is more than twenty times higher than Niagara.":"venezuela","TV Film and Stage : Lucille Le Sueur became famous as who":"Joan Crawford","Category: Trivia : What breed of dog has an inability to bark":"basenji","Quotations : Who said If you want something said ask a man. If you want something done ask a woman":"margaret thatcher","Who is the patron saint of navigators":"star of the sea","Pot Luck : What is shed when you desuamate":"skin","Which trophy is inscribed \"The Gentlemen's Single-Handed Championships of the World\"":"wimbledon men's singles cup","An altimeter measures what":"altitude","Mother the car what's the name of garfield's teddy bear":"pooky","Baby Names Beginning With \"H\":  Meaning: Good, Perfect":"hao","Food and Drink : What is the name given to sole cooked in white wine and cream with grapes":"sole veronique","TV/ Movies: Born May 4, 1929, She starred in this movie: Nous irons a Monte Carlo - 1951":"audrey hepburn","which famous mystery writer created a mystery by disappearing in 1926?":"agatha christie","Music : Philadelphia Freedom was performed by":"Elton John","Music : Complete the name of the 1970s group Sutherland Brothers and ":"quiver","Science and Technology : Karl Landsteiner was awarded the Nobel Prize for his findings in the field of haematology what was his discovery":"blood groups","Who wrote the novels on which the films 'Carrie' and 'The Shining' were based":"stephen king","Geography : What is the capital of Bosnia-Herzegovina":"Sarajevo","Useless Trivia: 0.3% of all road accidents in Canada involve a---------- .":"moose","Baby Names Beginning With \"T\":  Meaning: Noble, Lordly":"balti","TV/ Movies: Born Sep 5, 1940, She starred in this movie: 100 Rifles - 1969":"raquel welch","From where to where did the first railway on the witwatersrand run":"johannesburg to springs","Music : Which 1970s band had a hit with Mama Mia":"Abba","Food and Drink : Russian country cottage":"dacha","Name The Year: Philippe Petit walks tightrope strung between the twin towers of the World Trade Center, New York.":"1974","Fastest fingers or mouse go! supercalifragilisticexpialidocious":"supercalifragilisticexpialidocious","In 1894 E E---------- , poet, born. ":"cummings","Nature and Biology : What color are an albino elephants toenails":"white","Nature and Biology : What is the term used to describe a container-grown plant whose roots have filled the container":"pot bound","Food and Drink : What is the name for a narrow necked wine or spirit container of more than two gallon capacity":"demijohn","Useless Trivia: A man named Charles Osborne had the hiccups for ---------- years.":"69","Nature and Biology : Cervix of Uterus belongs to which system in the human body":"Reproductive","Nature and Biology : What is the floral emblem of New South Wales":"Waratah","Category: The 80s: First man to ride the space shuttle into orbit twice.":"john young","Who is the only real person to ever have been the head on a pez dispenser":"betsy ross","For which 1949 film did Anton Karas write and perform the music":"the third man","Science and Technology : At what angle above the horizon must the sun be to create a rainbow":"40 degrees","Pot Luck : What metal impurity makes rubies red and emeralds green":"Chromium","Pot Luck : When did the Fuller Brush Company begin using catalogs":"1986","Art Culture and Literature : Complete the couples - The late great writing team Will and Ariel ______":"durant","Geography : In _______ the Presidential highway links the towns of Gore and Clinton":"new zealand","Pot Luck : Who appears on the 10 000 dollar (US) note":"salmon chase\t","Music : I Dont Wanna Cry was performed by":"Mariah Carey","In 1932 Kingdom of ---------- formed (National Day). ":"saudi arabia","BaseBall - The Chicago ____":"cubs","TV Film and Stage : What is the link between the actresses Mia Farrow and Maureen OSullivan":"mother and daughter","Geography : What country is identified by the letter v on cars":"vatican city","Pot Luck : With which natural phenomena are Bailys Beads associated":"solar eclipse","What is the correct name for an animal's pouch":"marsupium","Art Culture and Literature : Name the Belgian crime writer who created Inspector Maigret":"georges simenon","Acronym Soup: ATLA ":"another three letter acronym","TV Film and Stage : Mad Max Beyond ___":"Thunderdome","Music : Duo who had a hit song with I got you babe":"sonny and cher","What is a \"ruderal\"":"weed","Which American state is nicknamed 'The Empire State of the South' or 'Peach State'":"georgia","80s Films: \"A woman is a hole, isn't that what they say?\"":"Witches of Eastwick","Word Play : Cacophobia is a fear of what":"ugliness","Music : Everybody Wants To Rule The World was performed by":"Tears For Fears","Name The Year: Francis Gary Powers convicted of spying by USSR (U-2 incident).":"1960","Science and Technology : Name the computer developed fromTurings bombes at Bletchley Park to decode the German Enigma codes during World War 2":"colossus","History : What geographical point did Robert Peary claim to have reached":"north pole","Category: Trivia : What does the Latin RIP stand for ":"requiescat in pace","Who was Bram Stoker's most infamous character":"dracula","Who invented the clockwork radio":"trevor bayliss","Music : The Last Mile was performed by":"Cinderella","Pot Luck : Whats bottled in jeroboams":"champagne","What is Chinese checkers played with":"marbles","TV/ Movies: 1995 - Drew Barrymore - Starred In This Movie: ":"boys on the side","Art Culture and Literature : The book Wamyouruijoshou was the first to use what word":"kite","What does bbl mean ":"be back later","UnScramble this Word:  e r f o t":"forte","In 1875 The game of \" ---------- \" -- a variation of pool -- is invented by Sir Neville Chamberlain, while on duty in India. ":"snooker","TV/ Movies: 1963 - Elizabeth Taylor - Starred In This Movie: ":"the v.i.p.'s","Geography : What Arabian peninsula nation was merged in 1990 from North and South portions":"Yemen","Food and Drink : What did Welchs grape juice become a favorite substitute for when the 18th amendment passed":"wine","Mysophobia is the fear of":"germs","Baby Names Beginning With \"L\":  Meaning: Love":"lerato","UnScramble this Word:  o i e t s r p":"ropiest","Music : Who sang islands in the stream with kenny rogers":"dolly parton","What fruit does the 'stackspur golden delicious' tree produce":"apples","Category: Trivia : What is known as the Lost Continent":"atlantis","TV/ Movies: Born Nov 19, 1962, She starred in this movie: Movies Are My Life - 1978":"jodie foster","Nature and Biology : What color body has the Nobody Crab":"Transparent","TV Film and Stage : What did the P in Roscoe P. Coltrane (from Dukes of Hazzard) stand for":"Purvis","Art Culture and Literature : Name the author of the poem He wrote Adonais upon hearing of John Keats death":"percy shelley","TV/ Movies: 1983 - Tom Cruise - Starred In This Movie: ":"risky business","Category: Geography : What is the capital of Laos":"vientiane","UnScramble this Word:  l n g r e c i":"clinger","In 1950 First \"---------- \" Comic Strip featuring Charlie Brown and Snoopy appears, in 9 newspapers ":"peanuts","A series of 15 radioactive elements in the periodic table (periodic law) with atomic numbers 89 through 103":"actinide series","TV/ Movies: 1997, This Movie was Released on January 10 The ---------- ":"relic","Category: Sports : Where were the 1900 Olympics held":"paris, france","What song's words were changed and then published in 1935 as 'happy birthday to you'":"good morning to you","TV/ Movies: 1999, This Movie was Released on October 22 The Best ---------- ":"man","In 1896 F. Scott ---------- (in St. Paul, MN), writer (Great Gatsby), born. ":"fitzgerald","TV/ Movies: Theme Songs: Movie that featured \"End of the Road\"":"boomerang","Category: Second City 2: Basra":"iraq","Category: Character Creators: Dodsworth":"sinclair lewis","What is the most important mineral for strong bones & teeth":"calcium","What is a 'kartoffel' in germany":"potato","UnScramble this Word:  n e a s r e d":"endears","TV/ Movies: Category: Dr Seuss: _Hop on ---_":"pop","In 1990 19 year old Pete Sampras beats Andre ---------- to win the US Open. ":"agassi","Acronym Soup: JFF ":"just for fun","Food and Drink : Indian dish of fried vegetables":"bhaji","Name The Year: Volcanic eruption in Cameroon releases poison gas, killing 2,000.":"1986","Acronym Soup: BMHATW ":"banging my head against the wall","UnScramble this Word:  o r e y s p":"osprey","Category: Languages : What ONE word fits ____stream; ____hill; _____pour.":"down","In 1927 Lindburgh lands in---------- , after 1st solo air crossing of Atlantic. ":"paris","What did Percy Shaw invent":"cat's eyes","Dish served between fish and meat courses":"entree","What does a cobbler mend":"shoes","Baby Names Beginning With \"B\":  Meaning: The Source of a River":"blaine","Pot Luck : What Indian word means big village":"Canada","What is the flower that stands for: restoration":"persicaria","Acronym Soup: TAWIS ":"that ain't what i said","Geography : The highest mountain in the British Isles Ben Nevis in western _______ is just 4 406 feet high. In many other countries a mountain of this size would be considered something less than a large hill":"scotland","What is the name of the Dukes of Hazzards car?":"General Lee","Sexuality : For how many dollars did an american urologist buy napoleons penis":"three thousand","Category: Made In Canada: City where Motley Crue recorded Dr. Feelgood.":"vancouver","UnScramble this Word:  s r s h m c t a i":"christmas","TV/ Movies: Category: Actor In The Role: Longfellow Deeds in 'Mr Deeds Goes to Town'":"gary cooper","Music : Lovin Every Minute of It was performed by":"Loverboy","What time do Spanish bullfights start":"five pm","Better known by her maiden name, who was the 1930s aviation pioneer Mrs. Mollison":"amy johnson","Baby Names Beginning With \"M\":  Meaning: Pure":"mariatu","Second city: St. Croix (U.S. Virgin Islands)":"st. thomas","Category: Geography : What is the capital of Malaysia":"kuala lumpur","Nature and Biology : The anaconda one of the worlds largest snakes gives birth to its young instead of _______":"laying eggs","What year was the Americans first atomic submarine launched":"1954","UnScramble this Word:  e g i w n m o":"meowing","Category: The Bible: This part of King Saul's belongings was displayed in the temple of Dagon":"his head","UnScramble this Word:  a s a b h a m":"bahamas","Word Play : Unscramble sniyo":"noisy","Music: Who is Pat Andrejewski better known as":"Pat Benatar","who was the first premier of russia and served from 1917 to 1924?":"nikolai lenin","What dirty building did heracles clean by diverting a river":"augean stables","TV Film and Stage : ___ of Dreams":"Field","Pot Luck : The indoor theatre at the new Globe being built in London will be named after which historical person":"inigo jones","Name The Year: Shirley Temple (in Santa Monica, CA), child actor, born.":"1928","Who presents the radio programme \"In the Psychiatrist's Chair\"":"anthony clare","Animal Trivia: The female knot-tying weaverbird will refuse to mate with a male who has built a shoddy nest. If spurned, the male must take the nest apart and completely rebuild it in order to win the ---------- of the female.":"affections","TV Film and Stage : Mmm. Tastes like fish":"Splash","Who wrote \"titus groan\"":"mervyn peake","This Canadian art-metal trio sings sci-fi themes a lot.":"Rush","What US state includes the telephone area code 513":"ohio","Category: Author : Thanatopsis\"":"bryant","What is a noggin":"a small cup","Quotations : He said ' Peace for our time ' ":"Neville Chamberlain","Category: Geography : Which is the Earth's fifth largest continent":"antarctica","Sport and Leisure : Southpaw to us means a boxer who leads with his right hand but in which sport did the term originate":"baseball","Geography : Britain owns half the Virgin Islands who owns the other half":"usa","TV/ Movies: Born Apr 3, 1961, He starred in this movie: Beverly Hills Cop III - 1994":"eddie murphy","What indian tribe is associated with \"the trail of tears\"":"cherokee","Comics and Cartoons : Hanna-Barbera rose to fame by creating what duo for MGM":"tom and jerry","Category: Cartoon Trivia : Miss Buckley is secretary to what commanding officer":"general halftrack","David Suchet gives a brilliant TV portrayal of this mustachioed detective":"hercule poirot","UnScramble this Word:  b t e r u t":"butter","on Different Strokes,who got kidnapped?":"Sam","Geography : In which state was Emily Dickinsons home":"massachusetts","He produced the Beatles \"Sgt. Peppers Lonely Hearts Club Band\"":"george","Geography : On which river does Berlin stand":"spree","Pot Luck : Who was the American millionaire given an honorary knighthood in 1980":"john paul getty jnr","Art Culture and Literature : What is the name for the kind of writing used by early Egyptians":"hieroglyphics","Geography : What do English speakers call the city that ltalians call Torino":"turin","Geography : What US State includes the telephone area code 513":"ohio","In 1868 Battle of Alcolea, causes Queen Isabella II of Spain to flee to---------- . ":"france","Category:  60s: First nation ever to resign from the united nations.":"indonesia","Category: Bestsellers: Trinity takes place in this country":"ireland","Art Culture and Literature : Complete the couples - Puss and ______ nursery rhyme":"boots","Who betrayed king arthur by sleeping with his wife guinevere":"sir lancelot","Pot Luck : Which quirky brunette was one of the first MTv VJs":"Martha Quinn","Pot Luck : Which country has international registration letter P":"portugal","Music : Stand Up (Kick Love Into Motion) was performed by":"Def Leppard","TV/ Movies: 1982 - Sally Field - Starred In This Movie: ":"kiss me goodbye","In 1968 Richard Nixon appears on \"---------- \". ":"laugh-in","History : At the time of Julius Caesar who was the ruler of Egypt":"cleopatra","What is he the chemical symbol for":"helium","Pot Luck : What was the name of Mary Pickfords and Douglas Fairbanks mansion":"pickfair","Music : A pair of small drums played with the fingers":"bongo","Geography : In what country is the Pageant of the Golden Tree celebrated":"belgium","Pot Luck : Who was the Italian captain who skied a penalty in the 1994 world cup finals penalty shootout":"franco baresi","Animal Trivia: The giant African ---------- grows to a foot long and reaches weights greater than a pound.":"snail","Name The Year: F.B.I. begins it's \"10 most wanted list\".":"1950","In 1893 Anton Dvorak's \"New ---------- Symphony\" premieres. ":"world","What is Venezuela named after":"venice","UnScramble this Word:  p s r a i":"paris","Useless Trivia: In the---------- , time is often measured by how long it takes to smoke a cigarette.":"andes","Useless Trivia: There is a city called ---------- in every continent.":"rome","What is the next-to-last event":"penultimate","Category: Hollywood : Which character sang \"Come Out, Come Out, Wherever You Are\" in \"The Wizard of Oz\"":"glinda","What is the lightest known substance":"hydrogen","7:25 pm In military time is how many hours":"1925","Sport and Leisure : What rules traditionally govern the sport of boxing":"Queensberry Rules","History : What wwii leader dallied with clara petacci":"benito mussolini","TV/ Movies: Category: Music Movie Trivia: This Gypsy song's footage is thought to be lost forever.":"together we go","TV/ Movies: 1997, This Movie was Released on May 2 ---------- ":"breakdown","TV/ Movies: 1935 - Lucille Ball - Starred In This Movie: ":"i'll love you always","Pot Luck : Which two countries formed tanzania":"tanganyika and zanzibar","Geography : What countrys major seaport is alexandria":"egypt","TV/ Movies: 1984 - Anthony Hopkins - Starred In This Movie: ":"the bounty","Pot Luck : What is the sixth month of the year":"june","Which religious order was founded by Saint Bruno":"carthusian","Acronym Soup HTTP":"hyper text transfer protocol","In 1950 David ---------- , Shirley Jones' kid on TV and real life, born.":"cassidy","TV/ Movies: 1999, This Movie was Released on June 11 The Red ---------- ":"violin","Baby Names Beginning With \"J\":  Meaning: Just":"justise","Category: Sport : Football: The Dallas _________.":"cowboys","Acronym Soup: CICO ":"coffee in coffee out","TV/ Movies: 1960 - Lucille Ball - Starred In This Movie: ":"the facts of life","Art Culture and Literature : Italian poet, critic and translator and Nobel prize winner of 1959 was born in 1901":"Salvatore Quasimodo","TV/ Movies: 1946 - Lucille Ball - Starred In This Movie: ":"lover come back","Advocating or practising total abstinence from alcohol":"teetotal","Sport and Leisure : How many feet high is a basketball net":"ten","TV/ Movies: Movie Theme Songs: Movie that featured \"(Don't You) Forget About Me\"":"breakfast club","What is the Capital of: United States ":"washington dc","TV/ Movies: Who won the Oscar for best ACTRESS in a Supporting role in 1989 62nd Academy Awards for the Movie MY LEFT FOOT":"brenda fricker","Destructive insect related to the grasshopper":"locust","Geography : There are approximately 320 000 _______ in the world":"icebergs","Who taught Alexander the Great":"aristotle","Art Culture and Literature : Abstract artist born in 1912, died in auto accident East Hampton in 1956, painted Lavender Mist":"Jackson Pollack","Science and Technology : What is the atomic number for palladium":"forty six","TV/ Movies: 2000, This Movie was Released on April 7 Rules of ---------- ":"engagement","What zone lies between the tropics of Capricorn &  Cancer":"tropical zone","Food and Drink : What has albumen and a yolk":"egg","Name The Year: Paula Abdul, singer, born.":"1962","what famous building did sir john vanbrugh design?":"blenheim palace","Nature and Biology : Ambrosia darkling and death watch are all kinds of what":"beetles","Word Play : Unscramble meid":"dime","Sport and Leisure : How much playing time is there in a football game":"sixty minutes","Food and Drink : Liquid food of oatmeal boiled in milk or water":"gruel","Category: Geography : In which country is Cusco":"peru","If you were born on 17 April what star sign (Zodiac) would you be":"aries","Food and Drink : the beer Icehouse comes from which US state":"wisconsin","TV/ Movies: Who was the vixen in the mini series East of Eden":"jane seymour","Baby Names Beginning With \"V\":  Meaning: Green":"verdi","Baby Names Beginning With \"G\":  Meaning: Servant":"giolla","TV Film and Stage : What did shirley temple always have in her hair":"curls","Pot Luck : What was the forerunner of croquet":"pall mall","What is Ronald Reagan's middle name":"wilson","Mythology : Who is the roman equivalant of the greek god eros":"amor","On 'southpark' what usually happens to kenny":"he gets killed","TV/ Movies: Born Apr 3, 1961, He starred in this movie: Harlem Nights - 1989":"eddie murphy","TV Film and Stage : Who played guitar on Goodbye Yellow Brick Road":"davey johnstone","Where was Salman Rushdie born":"bombay","Category: Shades Of Red: Biggest hit for the group Cyrkle":"red rubber ball","Nature and Biology : Progressive opacity of eye lens":"cataract","If you were born on 02 November what star sign (Zodiac) would you be":"scorpio","What tropic passes through Mexico":"cancer","Pot Luck : For centuries Spains _______ has been and still is one of the worlds largest":"fishing fleet","In which German city does the annual 'Oktoberfest' beer festival take place":"munich","Baby Names Beginning With \"D\":  Meaning: Hair or Poor":"delilah","These license plates are manufactured by prisoners in the state prison in Concord. What is the slogan on them":"live free or die","What ocean's area is 64,186,000 square miles":"pacific ocean","In 1851 \"The ---------- \" goes on sale at 2 cents a copy. ":"new york times","Name The Year: Charles Messier catalogs M41 (galactic cluster in Canis Major).":"1765","TV/ Movies: Category: Wings On TV: Name of Roy's ex-wife":"sylvia","TV Film and Stage : In which film was goldie hawn the body double for julia roberts":"pretty woman","UnScramble this Word:  a n e s r l n":"lanners","Category: Definitions : What is measured by a chronometer":"time","'This ain't no party, this ain't no disco ..' were lyrics from which group's 1979 release 'Life During Wartime'":"Talking Heads","Toys and Games : According to Mattel her manufacturer what is Barbies last name":"roberts","Pot Luck : Which cathedral city sixty miles from Paris has two spires":"chartres","In 1915 Anthony ---------- , Mexico, actor (Zorba the Greek, Lawrence of Arabia), born. ":"quinn","Comics and Cartoons : Famous Phrases : Who knows The ______":"shadow","Pot Luck : What is the third day of the week":"tuesday","An _____ clock usually wakes you in the morning":"alarm","What is the flower that stands for: enchantment":"holly herb","UnScramble this Word:  n g p p p o i":"popping","What's the basic unit for measuring electric energy":"joule","What is another name for crude oil":"black gold","Geography : What countries are known as the abc powers":"argentina brazil chile","What ancient measure was the distance from the elbow to the tip of the middle finger":"cubit","Geography : What is the capital of Faroe Islands":"Torshavn","Music : Heart Of Stone was performed by":"Europe","The city with the most riders in it's subway system is what":"moscow","Baby Names Beginning With \"N\":  Meaning: Snake":"nyoka","What are elementary particles originating in the sun and other stars, that continuously rain down on the earth":"cosmic rays","Useless Trivia: A ---------- measures blood pressure.":"sphygmomanometer","TV/ Movies: Back To The Future: Marty & Doc travel to 1955 again to prevent young Biff from receiving the":"almanac","Pot Luck : Which shipping area covers the North coast of Ireland":"malin","UnScramble this Word:  l g n t i m e":"melting","Music : Singer and entertainer born in 1927, famous for Caribbean songs":"Harry Belafonte","TV Film and Stage : In which musical is the song Hey Big Spender featured":"sweet charity","In 1949 Ed---------- , Jr., actor (St. Elsewhere, Real Genius, Spinal Tap), born. ":"begley","Useless Trivia: Aztec emperor ---------- had a nephew, Cuitlahac, whose name meant plenty of excrement.":"montezuma","Where did the clones have their laboratory in \"colony\"":"germantown","Mythology : It rules the Taurus and the Libra":"Venus","TV/ Movies: 1990 - Kirstie Alley - Starred In This Movie: ":"sibling rivalry","In music, the art of extemporization or creating all or part of a composition at the moment of performance?":"Improvisation","What caused a separation of Baja, California and the rest of Mexico?":"The San Andreas Fault","In 1951 Michael Keaton, actor (Pacific Heights, ---------- , Multiplicity), born. ":"batman","TV/ Movies: Category: Actors In Film: Tom Berenger, Sidney Poitier, Clancy Brown":"shoot to kill","What is the Capital of: Madagascar ":"antananarivo","Baby Names Beginning With \"S\":  Meaning: 8th Month":"september","Music : According to the Beatles where could you find 10 000 holes":"blackburn lancashire","Pot Luck : Which word is related to these three : rat blue cottage":"cheese","In Battle Star Galactica,What was the name of the human leader of the Cylons?":"Baltar","History : Which country first celebrated revolution day in 1978":"Afghanistan","TV Film and Stage : Point Maley is the coast guard cutter in what Disney movie":"boatniks","Baby Names Beginning With \"M\":  Meaning: Moor, Dark Skinned":"maurice","Pot Luck : Which day of the week is named after the moon":"monday","TV/ Movies: 1981 - Anthony Hopkins - Starred In This Movie: ":"the bunker","TV/ Movies: 2000, This Movie was Released on April 21 ---------- ":"u-571","Music : Solid was performed by":"Ashford and Simpson","TV Film and Stage : In License Plates : What sport does kicks enjoy":"soccer","who sang \"help me i think i'm falling\"?":"joni mitchell","David Letterman made his movie debut in what film":"Cabin Boy","Science and Technology : How many engines does the saturn rocket boast have":"eight","Category: Books: The Devil promised 24 years of happiness to this doctor in Marlowe's play":"faustus","TV/ Movies: Category: Highlander: Who was Duncan's love interest in the first season of the TV Show":"tessa noel","Music : Creedence clearwater revival sings have you ever ______":"seen the rain","TV/ Movies: Who were the guests on Johnny Carson's final tonite show":"bette midler & robin williams","Category: Hollywood : This is a classic film about a huge gorilla.":"king kong","Pot Luck : What planet is considered the earths twin in size and mass":"venus","Geography : Hawaii lies on the Tropic of":"cancer","UnScramble this Word:  c s l o l s r":"scrolls","What war lasted from june 5 to june 11 1967":"six day war","Music : Whoomp There It Is was performed by":"Tag Team","Pot Luck : Which Castle home of the Dukes of Rutland is near Grantham in Lincolnshire":"belvoir castle","TV/ Movies: Category: Hollywood: Gun twirler from Blazing Saddles":"gene wilder","What is the capital of Switzerland?":"Bern","In what city does Matlock take place?":"Atlanta,Georgia","Art Culture and Literature : Who wrote As I Lay Dying":"william faulkner","Pot Luck : The Smithsonian Institute houses this 44 & 1/2 carat cursed blue diamond":"hope diamond","What is a pyrotechnic display":"fireworks","Only 14% of americans say they've done this with the opposite sex. what is it":"skinny dipping","Pot Luck : If someone gets out of a difficult situation he is said to have saved his what":"bacon","Food and Drink : What color is angelica used in decorating cakes":"green","In a general sense, one who pleads for another in a court of law or other tribunal.":"advocate","A dark brown infesting insect":"cockroach","Food and Drink : How many litres water would a human drink in a lifetime":"500 million litres","TV/ Movies: 1957 - Audrey Hepburn - Starred In This Movie: ":"funny face","Category: Trivia : What is the meaning of diurnal":"daily","What is the art of bell-ringing called":"campanology","TV/ Movies: 1996 - Robin Williams - Starred In This Movie: ":"the secret agent","Geography: The only river that flows both north and south of the equator is the -------------. It crosses the equator twice.":"congo","Science and Technology : What does the computer acronym IKBS stand for":"intelligent knowledge based system","In 1980 Alfred Hitchcock ---------- -- Good Evening.":"knighted","In heraldry what is denote by a bar sinister":"illegitimacy","TV/ Movies: What looney toons character used a univac to solve a mystery":"porky pig","TV/ Movies: Born Sep 28, 1934, She starred in this movie: Histoires Extraordinaires/Spirits of the Dead - 1968":"brigitte bardot","UnScramble this Word:  r m p e l t a":"trample","Word Play : Lepraphobia is a fear of what":"leprosy","Art Culture and Literature : Who wrote Deptford Trilogy":"robertson davies","Candlestick maker what is the capital of iran":"teheran","What country was the first in the world to allow women voters?":"New Zealand","Sport and Leisure : Which 3 olympic events restrain throwers in a circle":"shot hammer and discus","Whose only loss in 1983 was to kathy horvath":"martina navratilova","In 1400 Author Geoffrey ---------- dies in London. ":"chaucer","History : Who sailed in the Nina, Pinta and Santa Maria":"Christopher Columbus","In 1961 ---------- Dylan's 1st NY performance. ":"bob","Who earned the nickname \"top gun\" in the Persian Gulf War":"Colin Powell","Name The Year: Glenn Miller records \"Pennsylvania 6-5000\".":"1940","If you were born on 20 August what star sign (Zodiac) would you be":"leo","Name The Year: City of Quebec founded by Samuel de Champlain.":"1608","Which metal, with the Atomic Number 3, is the lightest known solid element":"lithium","If you were born on 16 April what star sign (Zodiac) would you be":"aries","what do runners pass to each other in a relay race?":"a baton","Nature and Biology : Tissue or organ of the animal body characterized by the ability to contract usually in response to a stimulus from the nervous system":"muscle","TV/ Movies: Who threw a badly aimed tomahawk on tv's \"tonight show\"":"ed ames","Hot chocolate believes in miracles, and wants to know where you're from ______":"you sexy thing","What was Abelard's punishment for his romance with Heloise":"he was castrated","What is the flower that stands for: self-esteem":"poet's narcissus","TV/ Movies: Born Feb 27, 1932, She starred in this movie: A Place in the Sun - 1951":"elizabeth taylor","Science and Technology : In what year was the first telecommunications satellite launched":"1962","History : Admiral Donitz succeeded Hitler in which year":"1945","Comics and Cartoons : What are the names of donald ducks nephews":"huey dewey and louey","If you were born on 07 April what star sign (Zodiac) would you be":"aries","According to Roy Orbison, he's 'Saving nickels and dimes and looking forward to happier times on ______'":"Blue Bayou","TV Film and Stage : Who made his name in i dream of jeannie":"larry hagman","Music : Man in the mirror was performed by":"Michael Jackson","What country lifted a ban on Aristotle, Shakespeare & Dickens in 1978":"china","Music : Rooster was performed by":"Alice in chains","What is the term for a person who designs dance routines":"choreographer","Music : Paint The Sky With Stars was performed by":"Enya","Pot Luck : What was duke ellingtons real name":"edward kennedy","Food and Drink : The worlds rarest coffee Kopi Luwak comes from which country":"Indonesia","Quotations : If you can _______ it you can do it.- Walt Disney":"dream","Pot Luck : What is Camilla Parker Bowles nickname":"bulldog","What is the chemical symbol for silicon":"si","Pot Luck : What shuttle launch merited the Time cover headline whew":"discovery","What is the largest city in china":"shanghai","TV/ Movies: 1948 - Ingrid Bergman - Starred In This Movie: ":"arch of triumph","Baby Names Beginning With \"G\":  Meaning: Staff of the Goths":"gustave","Pot Luck : What is the general term used for various forms of insanity and mental derangement":"mental illness","How many years is a Sapphire Wedding Anniversary":"forty five","TV/ Movies: 1954 27th Academy Awards: Best Actress In A Leading Role Was Won By Grace Kelly For The Movie:":"the country girl","What is grimace of the Mcdonald's characters":"tastebud","If you were born on 03 December what star sign (Zodiac) would you be":"sagittarius","Music : Carrie was performed by":"Europe","Name The Year: Pioneer 11 transmitted images of Saturn and its rings.":"1978","Baby Names Beginning With \"A\":  Meaning: Lightning":"asnee","This was (until the Alaska purchase) the largest real estate deal in US history":"the Louisiana Purchase","Pot Luck : In the winter of 1724 while on an outing at sea _______ of Russia caught sight of a foundering ship jumped in the water and helped in the rescue. He caught cold suffered from a high fever and died several weeks later":"peter the great","Video Games: In Adventure, which castles require the bridge to explore fully?":"Black and White Castles","In 1777 ---------- recognizes the independance of the 13 US colonies. ":"france","Music : Always Be My Baby was performed by":"Mariah Carey","Name The Year: Florence Bascom US, 1st American woman PhD, born.":"1862","Food and Drink : A flat round soft creamy French cheese":"brie","In greek mythology, who turned arachne into a spider":"athena","Politics : The Balfour Declaration by Great Britain was in what year":"1917","Romanian comunist president shot in december 1989":"nicolae ceausescu","TV Film and Stage : Which Swiss town hosts the annual Golden Rose Television Festival":"montreux","TV/ Movies: Category: Indiana Jones: In the Temple of Doom, what bodily fluid is Indy forced to drink?":"blood","Nations What actor was married to Carole Lombard between 1939 to 1942":"clark gable","UnScramble this Word:  a i n o l b":"albino","What is a group of mallards in flight":"sord","Baby Names Beginning With \"J\":  Meaning: Slavic form of GERTRUDE":"jara","Who painted the picture The Light of the World in 1854":"holman hunt","Nature and Biology : The Chinese during the reign of Kublai Khan used lions on hunting expeditions. They trained the big cats to pursue and drag down massive animals - from wild bulls to bears - and to stay with the kill until the _______":"hunter arrived","Pot Luck : What was jane wyman reagans birth name":"sarah jane fulks","Acronym Soup: PST ":"pacific standard time","Music : What does the musical term Piano mean":"to be played softly","Pot Luck : Which sea separates Turkey from Greece":"aegean sea","Pot Luck : In the 1700s european women achieved a pale complexion by eating complexion wafers which were actually what poison":"arsenic","What is the largest natural harbour in south africa":"saldanha bay","Name The Year: Tchaikovsky's ballet \"Swan Lake\" premiers, St Petersburg.":"1895","Who was the U S first postmaster general":"benjamin franklin","Geography : What country was formerly called Ceylon":"sri lanka","Who wrote Goodbye Mr Chips":"james hilton","Aussie Slang: Mozzie":"mosquito","Pot Luck : What did Sir Rowland Hill introduce in Britain in 1840":"envelopes","UnScramble this Word:  c t u o n c o":"coconut","Aussie Slang: Push-bike":"bicycle","History : Frankish ruler Charles the Great is better known as _______":"charlemagne","In this team sport each player gets a chance to play every position?":"volleyball","What organization was the forerunner to the cia":"office of strategic services","Agency of the United States government, generally responsible for administering federal policy for Native Americans and Inuits (Eskimos)?":"bureau of indian affairs","Category: Geography : What is the capital of Romania":"bucharest","Comics and Cartoons : What kind of book did Dr Seuss pen five of ten best-sellers in US history by 1994":"childrens books","Category: Trivia : In the 17th century which country started taxing beards":"russia","What is the Capital of: Honduras ":"tegucigalpa","What is the product for the slogan 'the quicker-picker-upper'":"bounty","Category: Devils Dictionary: God of world's leading religion. His chief temple is in holy city of New York":"mammon","How many seams are there on an american football":"four","Nature and Biology : What do all bird NOT Have that all mammals do have":"stomach","TV Film and Stage : name the major star in the errand boy":"jerry lewis","Pot Luck : The Madeira islands lie in which ocean":"atlantic","Geography : What is the most rural state in the US":"north dakota","TV/ Movies: Star Trek: Deep Space 9: Kira's home planet":"bajar","Which country was named after the sea people known as Peleset or Philistines":"palestine","Pot Luck : Which spirit is the characteristic ingredient of Planters Punch":"rum","TV/ Movies:  Who was the first supposedly computer generated TV talk show host":"max headroom","Pot Luck : A pommel is part of a what":"saddle","TV/ Movies: Born Jul 6, 1946, He starred in this movie: Rocky V - 1990":"sylvester stallone","A person who sells fruit etc. from a barrow":"costermonger","Word Play : Unscramble ilon":"lion","Word Play : What is the fear of eyes known as":"ommetaphobia","Baby Names Beginning With \"S\":  Meaning: The Color Silver":"silver","Word Play : Oriental market":"bazaar","Pot Luck : Which legendary hero left the ruins of Troy and sailed to Italy to found the city of Rome":"aeneas","In 1963 Treaty banning ---------- nuclear tests signed by US, UK, USSR. ":"atmospheric","Geography : Boston is in which country":"USA","TV/ Movies: Who won the Oscar for best ACTRESS in a Leading Role in 1974 47th Academy Awards for the Movie ALICE DOESN'T LIVE HERE ANYMORE":"ellen burstyn","Art Culture and Literature : Name the original title of - Great White by Peter Benchley":"jaws","Pot Luck : Where is angel falls":"venezuela","Quotations: \"The greatest lesson in life is to know that even fools are right sometimes.\"":"Sir Winston Churchill","In 'les miserables', jean valjean's criminal number is the same as what character in 'the simpsons'":"sideshow bob","History : In World War 2 where was the defensive line known as The Gin Drinkers Line":"hong kong","Music : What pop group took their name from a Herman Hess novel":"Steppenwolff","Atlanta 1996 Olympics: This countries medal tally was: 0  Gold, 2  Silver, 0  Bronze, 2 in Total":"namibia","UnScramble this Word:  e e u v r n r":"nervure","80s Films: This town needs an enema.":"Batman","Art Culture and Literature : Which novel opens and closes with the letters of Robert Walton":"Frankenstein","What does elly may call her pets in the beverly hillbillies":"critters","What is the young of this animal called: Rat":"kitten","Music : Who signed the USA for Africa poster with his thumbprint":"stevie wonder","What kind of nuts were originally used in the old shell game":"walnuts","Pot Luck : In Germany where would you be if you were in a Krankenhaus":"hospital","TV/ Movies: Born Oct 4, 1976, She starred in this movie: The Babysitter - 1995":"alicia silverstone","Name The Year: Winston Churchill's \"Iron Curtain\" speech":"1946","Who was the dictator of Uganda from 1971 to 1979":"idi amin","Sport and Leisure : Which sport would you practice if you were a toxophilite":"archery","Pot Luck : Which australian duo took 13 nominations and 10 wins at the aria awards":"savage garden","TV Film and Stage : What is the name of this show in which after five years as Suzanne Sugarbaker,  Delta Burke leaves the cast":"designing women","Baby Names Beginning With \"M\":  Meaning: Ripples in the Water":"misu","TV/ Movies: 1954 - Elizabeth Taylor - Starred In This Movie: ":"elephant walk","Geography : Where in Australia is the Big Banana":"Coffs Harbour","Pot Luck : What was the name of the first US atomic submarine":"nautilus","With which part of the body is dermatology concerned":"skin","TV/ Movies: Who won the Oscar for best ACTRESS in a Leading Role in 1937 10th Academy Awards for the Movie THE GOOD EARTH":"luise rainer","UnScramble this Word:  e n n a o l b":"lebanon","Music : Girl you really got me was performed by":"Van Halen","Food and Drink : Shepherds pie is meat ground up covered with a layer of what mashed up":"potatoe","Baby Names Beginning With \"F\":  Meaning: Leafy Branch":"fronde","Pot Luck : To grill meat on a rack over charcoal":"charbroil","Acronym Soup: MCIBTY":"my computer is better than yours","Sport and Leisure : A type of windsurfing board that is less stable but faster than the standard one":"funboard","Who lost her sheep":"little bo peep","In 1897 ---------- last day as a city, it incorporates into NYC (1/1/1898). ":"brooklyn's","TV/ Movies: Who played captain nemo in \"20,000 leagues under the sea\"":"james mason","Geography: The Hawaiian Islands are the projecting tops of the biggest mountain range in the world. Mauna Kea, on the island of Hawaii, is the largest mountain on Earth - though partially submerged, it is 4,000 feet taller than -----------------":"mount everest","In 1990 Bush and ---------- meet in Helsinki and urge Iraq to leave Kuwait. ":"gorbachev","Baby Names Beginning With \"K\":  Meaning: Name":"keren","In 1984 ---------- Jones runs Chicago Marathon in world record 2 h 8 m 5 s. ":"steve","Mythology : what is the alternate name for pollux":"polydeuces","Toys and Games : This game of chance was originally called Beano":"bingo","In greek mythology, who was the hunter who was torn apart by artemis' dogs":"actaeon","Nature and Biology : What do the San Joaquin kit fox,  Hawaiian hawk and Ocelot have in common":"endangered species","Category: Mathematics : A triangle with two equal sides is called __________.":"isosceles","TV/ Movies: 1999 - Bruce Willis - Starred In This Movie: ":"the story of us","Nature and Biology : What is the general term for all chemical substances produced by the endocrine glands":"hormones","UnScramble this Word:  o a p d s i r":"sparoid","Word Play : Unscramble elaknt":"anklet","Art Culture and Literature : Scottish poet died in 1796":"Robert Burns","Name The Year: Edwin E \"Buzz\" Aldrin Jr, USAF/astro (Gem 12, Ap 11), born.":"1930","Martin what 1980's tv series starred bruce willis":"moonlighting","80s Films: Road ___":"House","Who wore laceless shoes and was said to regard undone shoelaces as unlucky":"anthony perkins","Which British town is famous for its cutlery production":"sheffield","Word Play : Graphophobia is a fear of what":"handwriting","Science and Technology : How long did Yuri Gagarins first orbit round the Earth take":"one hundred and eight minutes","In 65 A.D., which Roman emperor forced his former tutor, Seneca the Younger, to commit suicide":"nero","Art Culture and Literature : Which 19th Century poet was known as The Bard of Rydal Mount":"william wordsworth","Music : What was john lennons original middle name":"winston","On the body what is a calcaneium":"heel bone","Category: Books for the Hip Reader: Daisy Miller":"james","What film links Cher, Michelle Pfeiffer and Susan Sarandon":"the witches of eastwick","Category: Author: War and Remembrance":"herman wouk","Which is the only English word to both begin and end with the letters U-N-D ":"Underground","What is China's sorrow":"yellow river","In 1895 ---------- Pasteur dies. ":"louis","Music : I Shot The Sheriff was performed by":"Eric Clapton","Which classic Hollywood western is based on the film \"The Seven Samurai":"the magnificent seven","In which Olympics did Mark Spitz achieve a new Olympic record by winning seven gold medals":"1972","Which parent determines the gender of their offspring":"father","Geography : Name the chief port of Iraq":"basra","How many American voyages did Christopher Columbus make":"four","Music : Long Way Down was performed by":"Goo Goo Dolls","In 1980 Alfred  ---------- dies in Calif at 80 ":"hitchcock","Pot Luck : Red Questions : Sam Cooke sung about this little animal":"red rooster","Word Play : Unscramble ivalanl":"vanilla","What is the dish made from peppers, aubergines, courgettes and tomatoes called":"ratatouille","What race's runners refer to the noisy section along wellesley college as the \"screech tunnel\"":"africa","Pot Luck : Where is taipei":"taiwan","A woven fabric with raised pattern":"brocade","Art Culture and Literature : Reminiscences the longest one word title was written by this general":"douglas macarthur","Nature and Biology : Nipple belongs to which system in the human body":"Reproductive","In 1995 Last \"Far Side\" by cartoonist ---------- (started 1980) ":"gary larson","How many calories are there in a glass of water":"0","Besides being candidates for president in the 1996 U S elections, what do Bill Clinton, Ross Perot & Bob Dole have in common":"all left handed","Music : Far Behind was performed by":"Candlebox","Comics and Cartoons : Bugs Bunny made his debut in which year":"1935","TV/ Movies: 1979 - Sally Field - Starred In This Movie: ":"beyond the poseidon adventure","Pot Luck : What is the most mountainous country in Europe":"switzerland","Baby Names Beginning With \"C\":  Meaning: To the Castle":"castel","Baby Names Beginning With \"L\":  Meaning: Scandinavian":"loughlin","As sly as a ______":"fox","What make of car is a carrera":"porsche","In 1976 ---------- and Tobago becomes a republic. ":"trinidad","Which character did Lewis Carroll's Alice meet, sitting on a mushroom smoking a 'long hookah'":"the caterpillar","Art Culture and Literature : Name the author of This Canadian-born author wrote The Handmaids Tale and Rape Fantasies":"margaret atwood","On what number is the sexagesimal system based":"sixty","Music : Have You Never Been Mellow was performed by":"Olivia Newton John","Whose patron is St Gerard":"pregnant Women","Which country did boxer Lennox Lewis represent in the 1988 Olympics":"canada","Who was john reid":"lone ranger","Name The Year: Rod Steiger, actor, born.":"1925","Who painted the Mona Lisa":"leonardo da vinci","Baby Names Beginning With \"N\":  Meaning: Wave":"nami","Science and Technology : Growing plants in liquids rather than soil is known as _______":"hydroponics","Nature and Biology : An _______ egg can make eleven-and-a-half omelets":"ostrich","TV/ Movies: Category: James Bond: Letter name for James Bond's superior":"m","25th anniversary is silver, what's the 6th?":"iron","TV/ Movies: 1983 - Woody Allen - Starred In This Movie: ":"zelig","Name The Year: Hendrik Antoon Lorentz, Dutch physicist (Nobel 1902)":"1853","Category: Advertising: You are advised never to leave home without this.":"american express","UnScramble this Word:  w r t a e s e":"sweater","In the film Friday The Thirteenth, which character was the killer":"mrs. vorhees","Sport and Leisure : Under which rules was boxing standardised":"marquise of queensberry","Music : Who recorded the album Rio in 1983":"duran duran","Pot Luck : Which planet other than mercury does not have moons":"venus","Where is Dronning Maud land to be found":"antarctica","In which year were the first of the Dead Sea Scrolls discovered":"1947","TV/ Movies: Category: Get Smart: Smart's call number.":"86","Baby Names Beginning With \"G\":  Meaning: Powerful Soldier":"gellert","Who played the respectable hooker in \"From here to Eternity\"":"Donna Reed","Science and Technology : This was the first computer that offered an operating system that allowed users to move screen icons instead of typing instructions":"Macintosh","Musical groups: england dan and _____":"john ford coley","Category: Geography : This is the residence of English monarchs.":"buckingham palace","Baby Names Beginning With \"A\":  Meaning: Gracious":"anna","Of which country was Andreas Papandreou prime minister":"greece","Useless Trivia: A group of owls is called a---------- .":"parliament","In 1960  ---------- becomes the capital of Brazil. ":"brasilia","History : What century saw the War of the Roses":"15th","Pot Luck : Where did Thomas Magnum grow up as a kid":"San Diego","Mathematics : Plane figure with 7 sides and angles":"heptagon","What does 'HTTP' stand for?":"Hypertext Transfer Protocol","Music : Unchained was performed by":"Van Halen","Which company produced the first nylon":"dupont","TV/ Movies: Useless Space Trivia: What movie do all cosmonaughts watch before they go into space":"beloye solntse pustinny","Art Culture and Literature : Italian poet of Morgante was born in 1432":"Luigi Pulci","What do the pig, horse and rat have in common":"chinese astrology","Spiral slide at a funfair":"helter-skelter","Music : Cant help falling in love was performed by":"Ub40","Animal Trivia: It takes about 50 hours for a snake to digest one ----------":"frog","In 1886 Geronimo, ---------- indian, finally surrenders ending last major US-Indian war. ":"apache","Useless Trivia: California's Frank Epperson invented the Popsicle in 1905 when he was ---------- -years-old":"eleven.","Art Culture and Literature : The most shoplifted book in the world is _______":"the bible","Pot Luck : Anzac troops come from which 2 countries":"australia and new zealand","Pot Luck : The o when used as a prefix in irish surnames means what":"descendant of","Whose patron is St Barbara":"warehouses","UnScramble this Word:  g n e r e":"green","Name The Year: Yamaoka Tesshu Japanese swordsman, master of kendo, born. ":"1836","What is the capital of chile":"santiago","Baby Names Beginning With \"A\":  Meaning: Promised by God":"amaris","Pot Luck : To which planet does the moon Iapetus belong":"saturn","Name The Year: Robert Burns Scottish poet, dies.":"1796","On the show Cheers,What was the name of the restaurant above the bar.":"Melvilles","Word Play : Unscramble udnos":"sound","Aussie Slang: Full as a goog":"either full of food or alcohol","TV/ Movies: In which film based on a cartoon character did Madonna co star with Warren Beatty":"dick tracy","Pot Luck : Who still receives an estimated 25 pieces of junk mail per year at Walden Pond":"Thoreau","Which city was the location for the 1994 Winter Olympics":"lillehammer, norway","What's the USA's largest legal cash crop":"corn","Useless Facts: The highest known score for a single word in competition Scrabble is ---------":"three hundred and ninety two","Pot Luck : What Japanese city was the scene of a devastating earthquake in 1994":"kobe","Pot Luck : Who was the first pilot to fly faster than the speed of sound":"chuck yeager","Comics and Cartoons : Who is voice of Dilbert in the animated series":"Daniel Stern","Pot Luck : Who succeeded tommy douglas as leader of the new democratic party":"david lewis","TV/ Movies: 1993 - Harrison Ford - Starred In This Movie: ":"the fugitive","11:37 pm In military time is how many hours":"2337","Who leaked the pentagon papers to the new york times":"daniel ellsberg","Pot Luck : Which US city is named after an ancient capital of Egypt":"memphis","Pot Luck : What latin word means little shaded area":"umbrella","Religion : The date of which christian festival was fixed in 325 ad by the council of nicaea":"easter","TV/ Movies: Born Aug 17, 1943, He starred in this movie: Mean Streets - 1973":"robert de niro","Animal Trivia: There are 1,600 known species of ---------- in the world.":"starfishes","In 1905 ---------- Jansky, discoverer of cosmic radio emissions in 1932, born. ":"karl"}}